readme.org
#+title: Emacs configuration
#+author: Patrick D. Elliott
#+email: patrick.d.elliott@gmail.com
#+EXPORT_FILE_NAME: ./docs/index.html
#+SETUPFILE: theme-readtheorg.setup

Currently tailored for GNU Emacs 28.1.

* Useful resources

- [[https://www.lucacambiaghi.com/vanilla-emacs/readme.html][Luca's literate Emacs config]]
- [[https://github.com/alphapapa/ap.el][GitHub - alphapapa/ap.el: A simple, Emacs Lisp-focused Emacs config]]   
- [[https://github.com/abo-abo/oremacs][GitHub - abo-abo/oremacs: My Emacs config]]
- [[https://github.com/jwiegley/dot-emacs][GitHub - jwiegley/dot-emacs: My .emacs.el file and other personal Emacs goodies]]
- [[https://tecosaur.github.io/emacs-config/config.html][Tecoaur's Doom Emacs Configuration]]

* Early init file

:PROPERTIES:
:header-args: :tangle early-init.el
:END:

Since we're using ~straight.el~  as our package manager, we add the following to ~early-init.el~ to prevent ~package.el~ from loading packages, prior to our init file loading.

#+begin_src emacs-lisp
  ;;; early-init.el --- Early Init File -*- lexical-binding: t; no-byte-compile: t -*-

  (setq package-enable-at-startup nil)
#+end_src

Disable GUI elements before we have a chance to peek.

#+begin_src emacs-lisp
  ;; minimal UI
  (menu-bar-mode -1) ;; disables menubar
  (tool-bar-mode -1) ;; disables toolbar
  (scroll-bar-mode -1) ;; disables scrollbar

  (setq inhibit-splash-screen t ;; no thanks
	use-file-dialog nil ;; don't use system file dialog
	tab-bar-new-button-show nil ;; don't show new tab button
	tab-bar-close-button-show nil ;; don't show tab close button
	tab-line-close-button-show nil) ;; don't show tab close button
  ;;; early-init.el ends here
#+end_src

* Package management
:PROPERTIES:
:header-args: :tangle init.el
:END:

** ~init.el~ header

#+begin_src emacs-lisp
;;; init.el --- Personal configuration file -*- lexical-binding: t; no-byte-compile: t; -*-
;; NOTE: init.el is now generated from readme.org.  Please edit that file instead
#+end_src


** ~straight.el~

- [[https://github.com/raxod502/straight.el][GitHub - raxod502/straight.el: 🍀 Next-generation, purely functional package m...]]

Some rules/conventions:

- When packages don't require installation, use ~:straight (:type built-in)~.
- Prefer multiple ~setq~ expressions to one.
- Prefer ~:init~ to ~:custom~.
  
Quick how-to for straight:

- The lockfile is under version control at [[file:straight/versions/default.el][default.el]].
- Create a lockfile by running ~straight-freeze-versions~.
- Whenever I want to roll back to versions pinned in the lockfile run ~straight-thaw-versions~.
- Upgrade packages via ~straight-pull-all~.

