docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-04 Wed 16:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs configuration</title>
<meta name="author" content="Patrick D. Elliott" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Emacs configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6c28675">1. Useful resources</a></li>
<li><a href="#orge19d469">2. Early init file</a></li>
<li><a href="#org8554493">3. Package management</a>
<ul>
<li><a href="#org4011203">3.1. <code>init.el</code> header</a></li>
<li><a href="#org3f08d6d">3.2. <code>straight.el</code></a>
<ul>
<li><a href="#org8416a93">3.2.1. Bootstrap <code>straight.el</code></a></li>
<li><a href="#org8724d71">3.2.2. <span class="todo TODO">TODO</span> consider replacing with <code>elpaca</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8c6375f">4. Emacs</a>
<ul>
<li><a href="#org9ad50e1">4.1. Variables</a></li>
<li><a href="#org0b64a95">4.2. Defaults</a></li>
<li><a href="#orgdf9a6c9">4.3. Electric</a></li>
</ul>
</li>
<li><a href="#org7378f9a">5. Keybindings</a>
<ul>
<li><a href="#org4a19157">5.1. General</a></li>
<li><a href="#orgdac50aa">5.2. Evil</a>
<ul>
<li><a href="#org14f6ac7">5.2.1. Evil collection</a></li>
<li><a href="#orgbfdb321">5.2.2. Evil commentary</a></li>
<li><a href="#org19a0b68">5.2.3. Evil surround</a></li>
<li><a href="#orga198a7f">5.2.4. Evil goggles</a></li>
</ul>
</li>
<li><a href="#org944bc3c">5.3. Avy</a>
<ul>
<li><a href="#org3c5ed5e">5.3.1. Link hint</a></li>
</ul>
</li>
<li><a href="#org113d525">5.4. Which key</a></li>
</ul>
</li>
<li><a href="#orgc6000cb">6. Appearance</a>
<ul>
<li><a href="#org7c643ed">6.1. Icons</a></li>
<li><a href="#org60ef0a9">6.2. Olivetti</a></li>
<li><a href="#org2f65243">6.3. Mode line</a></li>
<li><a href="#org82c9506">6.4. Fonts</a></li>
<li><a href="#orgcf7ad45">6.5. Themes</a></li>
</ul>
</li>
<li><a href="#org889fb8f">7. Organization</a>
<ul>
<li><a href="#org93b7689">7.1. Buffer management</a>
<ul>
<li><a href="#orgdad1f50">7.1.1. <code>Popper</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1772ecd">8. Languages</a>
<ul>
<li><a href="#org70e621e">8.1. Lua</a></li>
<li><a href="#orgb0e2d9f">8.2. Lisp</a>
<ul>
<li><a href="#orgdd6f90f">8.2.1. Fennel</a></li>
<li><a href="#org65d27f9">8.2.2. Sly</a></li>
<li><a href="#org398ab35">8.2.3. lispy</a></li>
</ul>
</li>
<li><a href="#org5f6f221">8.3. Org</a>
<ul>
<li><a href="#org3e9e791">8.3.1. Org mode</a></li>
<li><a href="#org60c840e">8.3.2. Evil integration</a></li>
<li><a href="#orgd116aab">8.3.3. Org-auctex</a></li>
<li><a href="#org4af1644">8.3.4. Transclusion</a></li>
<li><a href="#org4e0ee00">8.3.5. Appear</a></li>
<li><a href="#org27fbb7f">8.3.6. Cliplink</a></li>
<li><a href="#org018d75c">8.3.7. Org modern</a></li>
<li><a href="#orge41b24b">8.3.8. Org roam</a></li>
<li><a href="#orgf363774">8.3.9. Export</a></li>
<li><a href="#org7d7217f">8.3.10. Highlighting</a></li>
<li><a href="#org04923e8">8.3.11. Org-noter</a></li>
</ul>
</li>
<li><a href="#org57bcab5">8.4. js</a></li>
<li><a href="#org44506bc">8.5. Rust</a></li>
<li><a href="#orgc6d8011">8.6. <span class="todo TODO">TODO</span> haskell</a></li>
<li><a href="#org0623335">8.7. racket</a></li>
<li><a href="#org07be7d8">8.8. nix</a></li>
<li><a href="#orgc7a24f4">8.9. <span class="todo SOMEDAY">SOMEDAY</span> latex</a>
<ul>
<li><a href="#orgad22320">8.9.1. Issues</a></li>
</ul>
</li>
<li><a href="#orgcadbe99">8.10. markdown</a></li>
</ul>
</li>
<li><a href="#orge8640dc">9. Completion</a>
<ul>
<li><a href="#orgb4ca9b8">9.1. Vertico with orderless and marginalia</a></li>
<li><a href="#orgb1add5b">9.2. Consult</a></li>
<li><a href="#org8bfdee7">9.3. Affe</a></li>
<li><a href="#org57a61b5">9.4. Embark</a></li>
<li><a href="#org9a0bf09">9.5. Corfu</a>
<ul>
<li><a href="#org2fbafc9">9.5.1. Cape</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4ad97f2">10. Checkers</a>
<ul>
<li><a href="#org9816c0c">10.1. Flymake</a></li>
</ul>
</li>
<li><a href="#org9c64672">11. Tools</a>
<ul>
<li><a href="#org91bc335">11.1. Jinx</a></li>
<li><a href="#org3fc3b08">11.2. Helpful</a></li>
<li><a href="#org8ac5ad7">11.3. Deadgrep</a></li>
<li><a href="#org9b6bb80">11.4. Snippets</a>
<ul>
<li><a href="#org3ee19ff">11.4.1. Auto-activating snippets</a></li>
<li><a href="#orga5cbab0">11.4.2. <span class="todo TODO">TODO</span> yasnippet</a></li>
<li><a href="#orga1242b1">11.4.3. <span class="todo TODO">TODO</span> Tempel</a></li>
</ul>
</li>
<li><a href="#orgf85ceed">11.5. Web preview</a></li>
<li><a href="#org4c0d57f">11.6. Magit</a></li>
<li><a href="#org4c887bf">11.7. Eshell</a></li>
<li><a href="#orge45e8c3">11.8. Language servers</a>
<ul>
<li><a href="#orgdfb8a8e">11.8.1. LSP mode</a></li>
<li><a href="#orgf06606a">11.8.2. Eglot</a></li>
</ul>
</li>
<li><a href="#orgce67b80">11.9. direnv</a></li>
<li><a href="#orgfe110f2">11.10. Kmonad</a>
<ul>
<li><a href="#orgfc8e496">11.10.1. <span class="todo TODO">TODO</span> disable flymake mode in kbd-mode</a></li>
</ul>
</li>
<li><a href="#orgfe960c7">11.11. <span class="todo TODO">TODO</span> Elfeed</a></li>
<li><a href="#org1df8a6e">11.12. <span class="todo TODO">TODO</span> Notmuch</a>
<ul>
<li><a href="#org9c427ec">11.12.1. consult-notmuch</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3b9ccf5">12. Staging grounds</a>
<ul>
<li><a href="#orgcd1d98d">12.1. Rainbow mode</a></li>
<li><a href="#org42e1a66">12.2. Burly</a></li>
<li><a href="#org3d8bdb5">12.3. Ebib</a>
<ul>
<li><a href="#orgd15ff3b">12.3.1. <span class="todo TODO">TODO</span> add biblio support</a></li>
</ul>
</li>
<li><a href="#orgea3b126">12.4. Tree-sitter</a></li>
</ul>
</li>
<li><a href="#orgc4b10cb">13. Graveyard</a>
<ul>
<li><a href="#org44fe114">13.1. Flymake-aspell</a></li>
<li><a href="#org1ef9cf1">13.2. Mastodon</a></li>
<li><a href="#orga175e79">13.3. <code>0x0</code></a></li>
<li><a href="#orgfc6a1c4">13.4. Org-re-reveal</a></li>
<li><a href="#org9c544ea">13.5. Org-present</a></li>
<li><a href="#orgcd17141">13.6. Sidebar</a></li>
<li><a href="#org1366240">13.7. company</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Currently tailored for GNU Emacs 29.1.
</p>
<div id="outline-container-org6c28675" class="outline-2">
<h2 id="org6c28675"><span class="section-number-2">1.</span> Useful resources</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://www.lucacambiaghi.com/vanilla-emacs/readme.html">Luca's literate Emacs config</a></li>
<li><a href="https://github.com/alphapapa/ap.el">GitHub - alphapapa/ap.el: A simple, Emacs Lisp-focused Emacs config</a></li>
<li><a href="https://github.com/abo-abo/oremacs">GitHub - abo-abo/oremacs: My Emacs config</a></li>
<li><a href="https://github.com/jwiegley/dot-emacs">GitHub - jwiegley/dot-emacs: My .emacs.el file and other personal Emacs goodies</a></li>
<li><a href="https://tecosaur.github.io/emacs-config/config.html">Tecoaur's Doom Emacs Configuration</a></li>
</ul>
</div>
</div>
<div id="outline-container-orge19d469" class="outline-2">
<h2 id="orge19d469"><span class="section-number-2">2.</span> Early init file</h2>
<div class="outline-text-2" id="text-2">
<p>
:header-args: :tangle early-init.el
</p>

<p>
Since we're using <code>straight.el</code>  as our package manager, we add the following to <code>early-init.el</code> to prevent <code>package.el</code> from loading packages, prior to our init file loading.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #6c7086;">;;; </span><span style="color: #505050;">early-init.el --- Early Init File -*- lexical-binding: t; no-byte-compile: t -*-</span>

(<span style="color: #cba6f7;">setq</span> package-enable-at-startup nil)
</pre>
</div>

<p>
Disable GUI elements before we have a chance to peek.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #6c7086;">;; </span><span style="color: #505050;">minimal UI</span>
(menu-bar-mode -1) <span style="color: #6c7086;">;; </span><span style="color: #505050;">disables menubar</span>
(tool-bar-mode -1) <span style="color: #6c7086;">;; </span><span style="color: #505050;">disables toolbar</span>
(scroll-bar-mode -1) <span style="color: #6c7086;">;; </span><span style="color: #505050;">disables scrollbar</span>

(<span style="color: #cba6f7;">setq</span> inhibit-splash-screen t <span style="color: #6c7086;">;; </span><span style="color: #505050;">no thanks</span>
        use-file-dialog nil <span style="color: #6c7086;">;; </span><span style="color: #505050;">don't use system file dialog</span>
        tab-bar-new-button-show nil <span style="color: #6c7086;">;; </span><span style="color: #505050;">don't show new tab button</span>
        tab-bar-close-button-show nil <span style="color: #6c7086;">;; </span><span style="color: #505050;">don't show tab close button</span>
        tab-line-close-button-show nil) <span style="color: #6c7086;">;; </span><span style="color: #505050;">don't show tab close button</span>
<span style="color: #6c7086;">;;; </span><span style="color: #505050;">early-init.el ends here</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8554493" class="outline-2">
<h2 id="org8554493"><span class="section-number-2">3.</span> Package management</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org4011203" class="outline-3">
<h3 id="org4011203"><span class="section-number-3">3.1.</span> <code>init.el</code> header</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #6c7086;">;;; </span><span style="color: #505050;">init.el --- Personal configuration file -*- lexical-binding: t; no-byte-compile: t; -*-</span>
<span style="color: #6c7086;">;; </span><span style="color: #863927; font-weight: bold;">NOTE</span><span style="color: #505050;">: init.el is now generated from readme.org.  Please edit that file instead</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org3f08d6d" class="outline-3">
<h3 id="org3f08d6d"><span class="section-number-3">3.2.</span> <code>straight.el</code></h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><a href="https://github.com/raxod502/straight.el">GitHub - raxod502/straight.el: 🍀 Next-generation, purely functional package m&#x2026;</a></li>
</ul>

<p>
Some rules/conventions:
</p>

<ul class="org-ul">
<li>When packages don't require installation, use <code>:straight (:type built-in)</code>.</li>
<li>Prefer multiple <code>setq</code> expressions to one.</li>
<li>Prefer <code>:init</code> to <code>:custom</code>.</li>
</ul>

<p>
Quick how-to for straight:
</p>

<ul class="org-ul">
<li>The lockfile is under version control at <a href="straight/versions/default.el">default.el</a>.</li>
<li>Create a lockfile by running <code>straight-freeze-versions</code>.</li>
<li>Whenever I want to roll back to versions pinned in the lockfile run <code>straight-thaw-versions</code>.</li>
<li>Upgrade packages via <code>straight-pull-all</code>.</li>
</ul>
</div>
