readme.org
*** Bootstrap ~straight.el~

#+begin_src emacs-lisp
  (setq straight-use-package-by-default t) ;; have use-package use straight.el by default.

  (defvar bootstrap-version)
  (let ((bootstrap-file
	 (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
	(bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
	  (url-retrieve-synchronously
	   "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
	   'silent 'inhibit-cookies)
	(goto-char (point-max))
	(eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  
#+end_src

Load org ASAP.

#+begin_src emacs-lisp
(straight-use-package 'org)
#+end_src

#+begin_src emacs-lisp
(straight-use-package 'use-package) ;; install use-package via straight
#+end_src

*** TODO consider replacing with ~elpaca~

- [[https://github.com/progfolio/elpaca][GitHub - progfolio/elpaca: An elisp package manager]]

* Emacs
:PROPERTIES:
:header-args: :tangle init.el
:END:

** Variables

#+begin_src emacs-lisp
  (defvar patrl/library-path "~/Dropbox (MIT)/library/"
    "Directory .pdf collection lives.")

  (defvar patrl/notes-path "~/notes/"
    "Notes.")

  (defvar patrl/journal-path (concat patrl/notes-path "daily/")
    "Journal entries.")

  (defvar patrl/global-bib-file "~/repos/bibliography/master.bib"
    "Bibliography.")

  (defvar patrl/org-path "~/Dropbox (MIT)/org/"
    "Org path.")
#+end_src

** Defaults

#+begin_src emacs-lisp
  (use-package emacs
    :init
    (setq user-full-name "Patrick D. Elliott") ;; my details
    (setq user-mail-address "patrick.d.elliott@gmail.com")

    (defalias 'yes-or-no-p 'y-or-n-p) ;; life is too short

    (setq indent-tabs-mode nil) ;; no tabs

    (setq make-backup-files nil) ;; keep everything under vc 
    (setq auto-save-default nil)

    ;; keep backup and save files in a dedicated directory
    (setq backup-directory-alist
	  `((".*" . ,(concat user-emacs-directory "backups")))
	  auto-save-file-name-transforms
	  `((".*" ,(concat user-emacs-directory "backups") t)))

    (setq create-lockfiles nil) ;; no need to create lockfiles

    (set-charset-priority 'unicode) ;; utf8 in every nook and cranny
    (setq locale-coding-system 'utf-8
	  coding-system-for-read 'utf-8
	  coding-system-for-write 'utf-8)
    (set-terminal-coding-system 'utf-8)
    (set-keyboard-coding-system 'utf-8)
    (set-selection-coding-system 'utf-8)
    (prefer-coding-system 'utf-8)
    (setq default-process-coding-system '(utf-8-unix . utf-8-unix))

    (global-set-key (kbd "<escape>") 'keyboard-escape-quit) ;; escape quits everything

    ;; Don't persist a custom file
    (setq custom-file (make-temp-file "")) ; use a temp file as a placeholder
    (setq custom-safe-themes t)            ; mark all themes as safe, since we can't persist now
    (setq enable-local-variables :all)     ; fix =defvar= warnings

    (setq delete-by-moving-to-trash t) ;; use trash-cli rather than rm when deleting files.

    ;; less noise when compiling elisp
    (setq byte-compile-warnings '(not free-vars unresolved noruntime lexical make-local))
    (setq native-comp-async-report-warnings-errors nil)
    (setq load-prefer-newer t)

    ;; FIXME currently using tempel in org-mode triggers this warning
    ;; (setq warning-suppress-types (append warning-suppress-types '((org-element-cache))))

    (show-paren-mode t)

    ;; Hide commands in M-x which don't work in the current mode
    (setq read-extended-command-predicate #'command-completion-default-include-p))
#+end_src

**  Electric 

#+begin_src emacs-lisp
  (use-package electric
    :straight (:type built-in)
    :init
    (electric-pair-mode +1) ;; automatically insert closing parens 
    (setq electric-pair-preserve-balance nil)) ;; more annoying than useful
#+end_src

* Keybindings
:PROPERTIES:
:header-args: :tangle init.el
:END:

Mnemonic keybindings with ~SPC~ as the leader key, inspired by spacemacs and doom emacs.

The local leader ~,~ is used for mode-specific bindings.

