docs/index.html
<div id="outline-container-org8416a93" class="outline-4">
<h4 id="org8416a93"><span class="section-number-4">3.2.1.</span> Bootstrap <code>straight.el</code></h4>
<div class="outline-text-4" id="text-3-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">setq</span> straight-use-package-by-default t) <span style="color: #6c7086;">;; </span><span style="color: #505050;">have use-package use straight.el by default.</span>

(<span style="color: #cba6f7;">defvar</span> <span style="color: #cdd6f4;">bootstrap-version</span>)
(<span style="color: #cba6f7;">let</span> ((bootstrap-file
         (expand-file-name <span style="color: #a6e3a1;">"straight/repos/straight.el/bootstrap.el"</span> user-emacs-directory))
        (bootstrap-version 5))
  (<span style="color: #cba6f7;">unless</span> (file-exists-p bootstrap-file)
    (<span style="color: #cba6f7;">with-current-buffer</span>
          (url-retrieve-synchronously
           <span style="color: #a6e3a1;">"https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"</span>
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))


</pre>
</div>

<p>
Load org ASAP.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(straight-use-package 'org)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(straight-use-package 'use-package) <span style="color: #6c7086;">;; </span><span style="color: #505050;">install use-package via straight</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8724d71" class="outline-4">
<h4 id="org8724d71"><span class="section-number-4">3.2.2.</span> <span class="todo TODO">TODO</span> consider replacing with <code>elpaca</code></h4>
<div class="outline-text-4" id="text-3-2-2">
<ul class="org-ul">
<li><a href="https://github.com/progfolio/elpaca">GitHub - progfolio/elpaca: An elisp package manager</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org8c6375f" class="outline-2">
<h2 id="org8c6375f"><span class="section-number-2">4.</span> Emacs</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org9ad50e1" class="outline-3">
<h3 id="org9ad50e1"><span class="section-number-3">4.1.</span> Variables</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">defvar</span> <span style="color: #cdd6f4;">patrl/library-path</span> <span style="color: #a6e3a1;">"~/Dropbox (MIT)/library/"</span>
  <span style="color: #2a486a;">"Directory .pdf collection lives."</span>)

(<span style="color: #cba6f7;">defvar</span> <span style="color: #cdd6f4;">patrl/notes-path</span> <span style="color: #a6e3a1;">"~/notes/"</span>
  <span style="color: #2a486a;">"Notes."</span>)

(<span style="color: #cba6f7;">defvar</span> <span style="color: #cdd6f4;">patrl/journal-path</span> (concat patrl/notes-path <span style="color: #a6e3a1;">"daily/"</span>)
  <span style="color: #2a486a;">"Journal entries."</span>)

(<span style="color: #cba6f7;">defvar</span> <span style="color: #cdd6f4;">patrl/global-bib-file</span> <span style="color: #a6e3a1;">"~/repos/bibliography/master.bib"</span>
  <span style="color: #2a486a;">"Bibliography."</span>)

(<span style="color: #cba6f7;">defvar</span> <span style="color: #cdd6f4;">patrl/org-path</span> <span style="color: #a6e3a1;">"~/Dropbox (MIT)/org/"</span>
  <span style="color: #2a486a;">"Org path."</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org0b64a95" class="outline-3">
<h3 id="org0b64a95"><span class="section-number-3">4.2.</span> Defaults</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">emacs</span>
  <span style="color: #f38ba8;">:init</span>
  (<span style="color: #cba6f7;">setq</span> user-full-name <span style="color: #a6e3a1;">"Patrick D. Elliott"</span>) <span style="color: #6c7086;">;; </span><span style="color: #505050;">my details</span>
  (<span style="color: #cba6f7;">setq</span> user-mail-address <span style="color: #a6e3a1;">"patrick.d.elliott@gmail.com"</span>)

  (<span style="color: #cba6f7;">defalias</span> '<span style="color: #89b4fa;">yes-or-no-p</span> 'y-or-n-p) <span style="color: #6c7086;">;; </span><span style="color: #505050;">life is too short</span>

  (<span style="color: #cba6f7;">setq</span> indent-tabs-mode nil) <span style="color: #6c7086;">;; </span><span style="color: #505050;">no tabs</span>

  (<span style="color: #cba6f7;">setq</span> make-backup-files nil) <span style="color: #6c7086;">;; </span><span style="color: #505050;">keep everything under vc </span>
  (<span style="color: #cba6f7;">setq</span> auto-save-default nil)

  <span style="color: #6c7086;">;; </span><span style="color: #505050;">keep backup and save files in a dedicated directory</span>
  (<span style="color: #cba6f7;">setq</span> backup-directory-alist
          `((<span style="color: #a6e3a1;">".*"</span> . ,(concat user-emacs-directory <span style="color: #a6e3a1;">"backups"</span>)))
          auto-save-file-name-transforms
          `((<span style="color: #a6e3a1;">".*"</span> ,(concat user-emacs-directory <span style="color: #a6e3a1;">"backups"</span>) t)))

  (<span style="color: #cba6f7;">setq</span> create-lockfiles nil) <span style="color: #6c7086;">;; </span><span style="color: #505050;">no need to create lockfiles</span>

  (set-charset-priority 'unicode) <span style="color: #6c7086;">;; </span><span style="color: #505050;">utf8 in every nook and cranny</span>
  (<span style="color: #cba6f7;">setq</span> locale-coding-system 'utf-8
          coding-system-for-read 'utf-8
          coding-system-for-write 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (set-selection-coding-system 'utf-8)
  (prefer-coding-system 'utf-8)
  (<span style="color: #cba6f7;">setq</span> default-process-coding-system '(utf-8-unix . utf-8-unix))

  (global-set-key (kbd <span style="color: #a6e3a1;">"&lt;escape&gt;"</span>) 'keyboard-escape-quit) <span style="color: #6c7086;">;; </span><span style="color: #505050;">escape quits everything</span>

  <span style="color: #6c7086;">;; </span><span style="color: #505050;">Don't persist a custom file</span>
  (<span style="color: #cba6f7;">setq</span> custom-file (make-temp-file <span style="color: #a6e3a1;">""</span>)) <span style="color: #6c7086;">; </span><span style="color: #505050;">use a temp file as a placeholder</span>
  (<span style="color: #cba6f7;">setq</span> custom-safe-themes t)            <span style="color: #6c7086;">; </span><span style="color: #505050;">mark all themes as safe, since we can't persist now</span>
  (<span style="color: #cba6f7;">setq</span> enable-local-variables <span style="color: #f38ba8;">:all</span>)     <span style="color: #6c7086;">; </span><span style="color: #505050;">fix =defvar= warnings</span>

  (<span style="color: #cba6f7;">setq</span> delete-by-moving-to-trash t) <span style="color: #6c7086;">;; </span><span style="color: #505050;">use trash-cli rather than rm when deleting files.</span>

  <span style="color: #6c7086;">;; </span><span style="color: #505050;">less noise when compiling elisp</span>
  (<span style="color: #cba6f7;">setq</span> byte-compile-warnings '(not free-vars unresolved noruntime lexical make-local))
  (<span style="color: #cba6f7;">setq</span> native-comp-async-report-warnings-errors nil)
  (<span style="color: #cba6f7;">setq</span> load-prefer-newer t)

  <span style="color: #6c7086;">;; </span><span style="color: #a0132f; font-weight: bold;">FIXME</span><span style="color: #505050;"> currently using tempel in org-mode triggers this warning</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">(setq warning-suppress-types (append warning-suppress-types '((org-element-cache))))</span>

  (show-paren-mode t)

  <span style="color: #6c7086;">;; </span><span style="color: #505050;">Hide commands in M-x which don't work in the current mode</span>
  (<span style="color: #cba6f7;">setq</span> read-extended-command-predicate #'command-completion-default-include-p))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdf9a6c9" class="outline-3">
<h3 id="orgdf9a6c9"><span class="section-number-3">4.3.</span> Electric</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">electric</span>
  <span style="color: #f38ba8;">:straight</span> (<span style="color: #f38ba8;">:type</span> built-in)
  <span style="color: #f38ba8;">:init</span>
  (electric-pair-mode +1) <span style="color: #6c7086;">;; </span><span style="color: #505050;">automatically insert closing parens </span>
  (<span style="color: #cba6f7;">setq</span> electric-pair-preserve-balance nil)) <span style="color: #6c7086;">;; </span><span style="color: #505050;">more annoying than useful</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7378f9a" class="outline-2">
<h2 id="org7378f9a"><span class="section-number-2">5.</span> Keybindings</h2>
<div class="outline-text-2" id="text-5">
<p>
Mnemonic keybindings with <code>SPC</code> as the leader key, inspired by spacemacs and doom emacs.
</p>

<p>
The local leader <code>,</code> is used for mode-specific bindings.
</p>
</div>
