readme.org
** General

  #+begin_src emacs-lisp
    (use-package general
      :config
      (general-evil-setup)
      ;; integrate general with evil

      ;; set up 'SPC' as the global leader key
      (general-create-definer patrl/leader-keys
        :states '(normal insert visual emacs)
        :keymaps 'override
        :prefix "SPC" ;; set leader
        :global-prefix "M-SPC") ;; access leader in insert mode

      ;; set up ',' as the local leader key
      (general-create-definer patrl/local-leader-keys
        :states '(normal insert visual emacs)
        :keymaps 'override
        :prefix "," ;; set local leader
        :global-prefix "M-,") ;; access local leader in insert mode

      (general-define-key
       :states 'insert
       "C-g" 'evil-normal-state) ;; don't stretch for ESC

      ;; unbind some annoying default bindings
      (general-unbind
        "C-x C-r"	;; unbind find file read only
        "C-x C-z"	;; unbind suspend frame
        "C-x C-d"	;; unbind list directory
        "<mouse-2>") ;; pasting with mouse wheel click


      (patrl/leader-keys
        "SPC" '(execute-extended-command :wk "execute command") ;; an alternative to 'M-x'
        "TAB" '(:keymap tab-prefix-map :wk "tab")) ;; remap tab bindings

      (patrl/leader-keys
        "c" '(:ignore t :wk "code"))

      ;; help
      ;; namespace mostly used by 'helpful'
      (patrl/leader-keys
        "h" '(:ignore t :wk "help"))

      ;; file
      (patrl/leader-keys
        "f" '(:ignore t :wk "file")
        "ff" '(find-file :wk "find file") ;; gets overridden by consult
        "fs" '(save-buffer :wk "save file"))

      ;; buffer 
      ;; see 'bufler' and 'popper'
      (patrl/leader-keys
        "b" '(:ignore t :wk "buffer")
        "bb" '(switch-to-buffer :wk "switch buffer") ;; gets overridden by consult
        "bk" '(kill-this-buffer :wk "kill this buffer")
        "br" '(revert-buffer :wk "reload buffer"))

      ;; bookmark
      (patrl/leader-keys
        "B" '(:ignore t :wk "bookmark")
        "Bs" '(bookmark-set :wk "set bookmark")
        "Bj" '(bookmark-jump :wk "jump to bookmark"))

      ;; universal argument
      (patrl/leader-keys
        "u" '(universal-argument :wk "universal prefix"))

      ;; notes
      ;; see 'citar' and 'org-roam'
      (patrl/leader-keys
        "n" '(:ignore t :wk "notes")
        ;; see org-roam and citar sections
        "na" '(org-todo-list :wk "agenda todos")) ;; agenda

      ;; code
      ;; see 'flymake'
      (patrl/leader-keys
        "c" '(:ignore t :wk "code"))

      ;; open
      (patrl/leader-keys
        "o" '(:ignore t :wk "open")
        "os" '(speedbar t :wk "speedbar")) ;; TODO this needs some love

      ;; search
      ;; see 'consult'
      (patrl/leader-keys
        "s" '(:ignore t :wk "search"))

      ;; templating
      ;; see 'tempel'
      (patrl/leader-keys
        "t" '(:ignore t :wk "template")))

    ;; "c" '(org-capture :wk "capture")))
  #+end_src

