docs/index.html
<div id="outline-container-org4a19157" class="outline-3">
<h3 id="org4a19157"><span class="section-number-3">5.1.</span> General</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">general</span>
  <span style="color: #f38ba8;">:config</span>
  (general-evil-setup)
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">integrate general with evil</span>

  <span style="color: #6c7086;">;; </span><span style="color: #505050;">set up '</span><span style="color: #fab387;">SPC</span><span style="color: #505050;">' as the global leader key</span>
  (<span style="color: #cba6f7;">general-create-definer</span> patrl/leader-keys
    <span style="color: #f38ba8;">:states</span> '(normal insert visual emacs)
    <span style="color: #f38ba8;">:keymaps</span> 'override
    <span style="color: #f38ba8;">:prefix</span> <span style="color: #a6e3a1;">"SPC"</span> <span style="color: #6c7086;">;; </span><span style="color: #505050;">set leader</span>
    <span style="color: #f38ba8;">:global-prefix</span> <span style="color: #a6e3a1;">"M-SPC"</span>) <span style="color: #6c7086;">;; </span><span style="color: #505050;">access leader in insert mode</span>

  <span style="color: #6c7086;">;; </span><span style="color: #505050;">set up ',' as the local leader key</span>
  (<span style="color: #cba6f7;">general-create-definer</span> patrl/local-leader-keys
    <span style="color: #f38ba8;">:states</span> '(normal insert visual emacs)
    <span style="color: #f38ba8;">:keymaps</span> 'override
    <span style="color: #f38ba8;">:prefix</span> <span style="color: #a6e3a1;">","</span> <span style="color: #6c7086;">;; </span><span style="color: #505050;">set local leader</span>
    <span style="color: #f38ba8;">:global-prefix</span> <span style="color: #a6e3a1;">"M-,"</span>) <span style="color: #6c7086;">;; </span><span style="color: #505050;">access local leader in insert mode</span>

  (general-define-key
   <span style="color: #f38ba8;">:states</span> 'insert
   <span style="color: #a6e3a1;">"C-g"</span> 'evil-normal-state) <span style="color: #6c7086;">;; </span><span style="color: #505050;">don't stretch for ESC</span>

  <span style="color: #6c7086;">;; </span><span style="color: #505050;">unbind some annoying default bindings</span>
  (<span style="color: #cba6f7;">general-unbind</span>
    <span style="color: #a6e3a1;">"C-x C-r"</span>   <span style="color: #6c7086;">;; </span><span style="color: #505050;">unbind find file read only</span>
    <span style="color: #a6e3a1;">"C-x C-z"</span>   <span style="color: #6c7086;">;; </span><span style="color: #505050;">unbind suspend frame</span>
    <span style="color: #a6e3a1;">"C-x C-d"</span>   <span style="color: #6c7086;">;; </span><span style="color: #505050;">unbind list directory</span>
    <span style="color: #a6e3a1;">"&lt;mouse-2&gt;"</span>) <span style="color: #6c7086;">;; </span><span style="color: #505050;">pasting with mouse wheel click</span>


  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"SPC"</span> '(execute-extended-command <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"execute command"</span>) <span style="color: #6c7086;">;; </span><span style="color: #505050;">an alternative to '</span><span style="color: #fab387;">M-x</span><span style="color: #505050;">'</span>
    <span style="color: #a6e3a1;">"TAB"</span> '(<span style="color: #f38ba8;">:keymap</span> tab-prefix-map <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"tab"</span>)) <span style="color: #6c7086;">;; </span><span style="color: #505050;">remap tab bindings</span>

  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"c"</span> '(<span style="color: #f38ba8;">:ignore</span> t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"code"</span>))

  <span style="color: #6c7086;">;; </span><span style="color: #505050;">help</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">namespace mostly used by '</span><span style="color: #fab387;">helpful</span><span style="color: #505050;">'</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"h"</span> '(<span style="color: #f38ba8;">:ignore</span> t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"help"</span>))

  <span style="color: #6c7086;">;; </span><span style="color: #505050;">file</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"f"</span> '(<span style="color: #f38ba8;">:ignore</span> t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"file"</span>)
    <span style="color: #a6e3a1;">"ff"</span> '(find-file <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"find file"</span>) <span style="color: #6c7086;">;; </span><span style="color: #505050;">gets overridden by consult</span>
    <span style="color: #a6e3a1;">"fs"</span> '(save-buffer <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"save file"</span>))

  <span style="color: #6c7086;">;; </span><span style="color: #505050;">buffer </span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">see '</span><span style="color: #fab387;">bufler</span><span style="color: #505050;">' and '</span><span style="color: #fab387;">popper</span><span style="color: #505050;">'</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"b"</span> '(<span style="color: #f38ba8;">:ignore</span> t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"buffer"</span>)
    <span style="color: #a6e3a1;">"bb"</span> '(switch-to-buffer <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"switch buffer"</span>) <span style="color: #6c7086;">;; </span><span style="color: #505050;">gets overridden by consult</span>
    <span style="color: #a6e3a1;">"bk"</span> '(kill-this-buffer <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"kill this buffer"</span>)
    <span style="color: #a6e3a1;">"br"</span> '(revert-buffer <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"reload buffer"</span>))

  <span style="color: #6c7086;">;; </span><span style="color: #505050;">bookmark</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"B"</span> '(<span style="color: #f38ba8;">:ignore</span> t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"bookmark"</span>)
    <span style="color: #a6e3a1;">"Bs"</span> '(bookmark-set <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"set bookmark"</span>)
    <span style="color: #a6e3a1;">"Bj"</span> '(bookmark-jump <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"jump to bookmark"</span>))

  <span style="color: #6c7086;">;; </span><span style="color: #505050;">universal argument</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"u"</span> '(universal-argument <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"universal prefix"</span>))

  <span style="color: #6c7086;">;; </span><span style="color: #505050;">notes</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">see '</span><span style="color: #fab387;">citar</span><span style="color: #505050;">' and '</span><span style="color: #fab387;">org-roam</span><span style="color: #505050;">'</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"n"</span> '(<span style="color: #f38ba8;">:ignore</span> t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"notes"</span>)
    <span style="color: #6c7086;">;; </span><span style="color: #505050;">see org-roam and citar sections</span>
    <span style="color: #a6e3a1;">"na"</span> '(org-todo-list <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"agenda todos"</span>)) <span style="color: #6c7086;">;; </span><span style="color: #505050;">agenda</span>

  <span style="color: #6c7086;">;; </span><span style="color: #505050;">code</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">see '</span><span style="color: #fab387;">flymake</span><span style="color: #505050;">'</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"c"</span> '(<span style="color: #f38ba8;">:ignore</span> t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"code"</span>))

  <span style="color: #6c7086;">;; </span><span style="color: #505050;">open</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"o"</span> '(<span style="color: #f38ba8;">:ignore</span> t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"open"</span>)
    <span style="color: #a6e3a1;">"os"</span> '(speedbar t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"speedbar"</span>)) <span style="color: #6c7086;">;; </span><span style="color: #721045; font-weight: bold;">TODO</span><span style="color: #505050;"> this needs some love</span>

  <span style="color: #6c7086;">;; </span><span style="color: #505050;">search</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">see '</span><span style="color: #fab387;">consult</span><span style="color: #505050;">'</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"s"</span> '(<span style="color: #f38ba8;">:ignore</span> t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"search"</span>))

  <span style="color: #6c7086;">;; </span><span style="color: #505050;">templating</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">see '</span><span style="color: #fab387;">tempel</span><span style="color: #505050;">'</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"t"</span> '(<span style="color: #f38ba8;">:ignore</span> t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"template"</span>)))

<span style="color: #6c7086;">;; </span><span style="color: #505050;">"c" '(org-capture :wk "capture")))</span>
</pre>
</div>
</div>
</div>
