readme.org
** Evil

#+begin_src emacs-lisp
  (use-package evil
    :general
    (patrl/leader-keys
      "w" '(:keymap evil-window-map :wk "window")) ;; window bindings
    :init
    (setq evil-search-module 'isearch)

    (setq evil-want-C-u-scroll t) ;; allow scroll up with 'C-u'
    (setq evil-want-C-d-scroll t) ;; allow scroll down with 'C-d'

    (setq evil-want-integration t) ;; necessary for evil collection
    (setq evil-want-keybinding nil)

    (setq evil-split-window-below t)
    (setq evil-vsplit-window-right t)

    (setq evil-want-C-i-jump nil) ;; hopefully this will fix weird tab behaviour

    (setq evil-undo-system 'undo-redo) ;; undo via 'u', and redo the undone change via 'C-r'; only available in emacs 28+.
    :config
    (evil-mode t) ;; globally enable evil mode
    ;; set the initial state for some kinds of buffers.
    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal)
    ;; buffers in which I want to immediately start typing should be in 'insert' state by default.
    (evil-set-initial-state 'eshell-mode 'insert)
    (evil-set-initial-state 'magit-diff-mode 'insert))
#+end_src 

*** Evil collection

#+begin_src emacs-lisp
  (use-package evil-collection ;; evilifies a bunch of things
    :after evil
    :init
    (setq evil-collection-outline-bind-tab-p t) ;; '<TAB>' cycles visibility in 'outline-minor-mode'
    ;; If I want to incrementally enable evil-collection mode-by-mode, I can do something like the following:
    ;; (setq evil-collection-mode-list nil) ;; I don't like surprises
    ;; (add-to-list 'evil-collection-mode-list 'magit) ;; evilify magit
    ;; (add-to-list 'evil-collection-mode-list '(pdf pdf-view)) ;; evilify pdf-view
    :config
    (evil-collection-init))
#+end_src

*** Evil commentary

Port of Tim Pope's commentary package

#+begin_src emacs-lisp
  (use-package evil-commentary
    :after evil
    :config
    (evil-commentary-mode)) ;; globally enable evil-commentary
#+end_src

*** Evil surround

Port of Tim Pope's surround package

#+begin_src emacs-lisp
  (use-package evil-surround
    :after evil
    :hook ((org-mode . (lambda () (push '(?~ . ("~" . "~")) evil-surround-pairs-alist)))
           (org-mode . (lambda () (push '(?$ . ("\\(" . "\\)")) evil-surround-pairs-alist))))
    :config
    (global-evil-surround-mode 1)) ;; globally enable evil-surround
#+end_src

*** Evil goggles

Show visual hints for evil motions.

#+begin_src emacs-lisp
  (use-package evil-goggles
    :config
    (evil-goggles-mode)

    ;; optionally use diff-mode's faces; as a result, deleted text
    ;; will be highlighed with `diff-removed` face which is typically
    ;; some red color (as defined by the color theme)
    ;; other faces such as `diff-added` will be used for other actions
    (evil-goggles-use-diff-faces))
#+end_src

** Avy

- [[https://karthinks.com/software/avy-can-do-anything/][Avy can do anything | Karthinks]]

Super-charged navigaton.

Use ~.~ after an avy command to trigger ~embark-act~ on the selected candidate. 

#+begin_src emacs-lisp
    (use-package avy
      :init
  (defun patrl/avy-action-insert-newline (pt)
        (save-excursion
          (goto-char pt)
          (newline))
        (select-window
         (cdr
          (ring-ref avy-ring 0))))
      (defun patrl/avy-action-kill-whole-line (pt)
        (save-excursion
          (goto-char pt)
          (kill-whole-line))
        (select-window
         (cdr
          (ring-ref avy-ring 0))))
      (defun patrl/avy-action-embark (pt)
        (unwind-protect
            (save-excursion
              (goto-char pt)
              (embark-act))
          (select-window
           (cdr (ring-ref avy-ring 0))))
        t) ;; adds an avy action for embark
      :general
      (general-def '(normal motion)
        "s" 'evil-avy-goto-char-timer
        "f" 'evil-avy-goto-char-in-line
        "gl" 'evil-avy-goto-line ;; this rules
        ";" 'avy-resume)
      :config
      (setf (alist-get ?. avy-dispatch-alist) 'patrl/avy-action-embark ;; embark integration
            (alist-get ?i avy-dispatch-alist) 'patrl/avy-action-insert-newline
            (alist-get ?K avy-dispatch-alist) 'patrl/avy-action-kill-whole-line)) ;; kill lines with avy
#+end_src

*** Link hint

#+begin_src emacs-lisp
  (use-package link-hint
    :general
    (patrl/leader-keys
      "l" '(link-hint-open-link :wk "open link"))
    :config
    (setq browse-url-browser-function 'browse-url-firefox)
    (setq link-hint-avy-style 'pre))
#+end_src

