docs/index.html
<div id="outline-container-orgdac50aa" class="outline-3">
<h3 id="orgdac50aa"><span class="section-number-3">5.2.</span> Evil</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">evil</span>
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"w"</span> '(<span style="color: #f38ba8;">:keymap</span> evil-window-map <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"window"</span>)) <span style="color: #6c7086;">;; </span><span style="color: #505050;">window bindings</span>
  <span style="color: #f38ba8;">:init</span>
  (<span style="color: #cba6f7;">setq</span> evil-search-module 'isearch)

  (<span style="color: #cba6f7;">setq</span> evil-want-C-u-scroll t) <span style="color: #6c7086;">;; </span><span style="color: #505050;">allow scroll up with '</span><span style="color: #fab387;">C-u</span><span style="color: #505050;">'</span>
  (<span style="color: #cba6f7;">setq</span> evil-want-C-d-scroll t) <span style="color: #6c7086;">;; </span><span style="color: #505050;">allow scroll down with '</span><span style="color: #fab387;">C-d</span><span style="color: #505050;">'</span>

  (<span style="color: #cba6f7;">setq</span> evil-want-integration t) <span style="color: #6c7086;">;; </span><span style="color: #505050;">necessary for evil collection</span>
  (<span style="color: #cba6f7;">setq</span> evil-want-keybinding nil)

  (<span style="color: #cba6f7;">setq</span> evil-split-window-below t)
  (<span style="color: #cba6f7;">setq</span> evil-vsplit-window-right t)

  (<span style="color: #cba6f7;">setq</span> evil-want-C-i-jump nil) <span style="color: #6c7086;">;; </span><span style="color: #505050;">hopefully this will fix weird tab behaviour</span>

  (<span style="color: #cba6f7;">setq</span> evil-undo-system 'undo-redo) <span style="color: #6c7086;">;; </span><span style="color: #505050;">undo via '</span><span style="color: #fab387;">u</span><span style="color: #505050;">', and redo the undone change via '</span><span style="color: #fab387;">C-r</span><span style="color: #505050;">'; only available in emacs 28+.</span>
  <span style="color: #f38ba8;">:config</span>
  (evil-mode t) <span style="color: #6c7086;">;; </span><span style="color: #505050;">globally enable evil mode</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">set the initial state for some kinds of buffers.</span>
  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal)
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">buffers in which I want to immediately start typing should be in '</span><span style="color: #fab387;">insert</span><span style="color: #505050;">' state by default.</span>
  (evil-set-initial-state 'eshell-mode 'insert)
  (evil-set-initial-state 'magit-diff-mode 'insert))
</pre>
</div>
</div>
<div id="outline-container-org14f6ac7" class="outline-4">
<h4 id="org14f6ac7"><span class="section-number-4">5.2.1.</span> Evil collection</h4>
<div class="outline-text-4" id="text-5-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">evil-collection</span> <span style="color: #6c7086;">;; </span><span style="color: #505050;">evilifies a bunch of things</span>
  <span style="color: #f38ba8;">:after</span> evil
  <span style="color: #f38ba8;">:init</span>
  (<span style="color: #cba6f7;">setq</span> evil-collection-outline-bind-tab-p t) <span style="color: #6c7086;">;; </span><span style="color: #505050;">'</span><span style="color: #fab387;">&lt;TAB&gt;</span><span style="color: #505050;">' cycles visibility in '</span><span style="color: #fab387;">outline-minor-mode</span><span style="color: #505050;">'</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">If I want to incrementally enable evil-collection mode-by-mode, I can do something like the following:</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">(setq evil-collection-mode-list nil) ;; I don't like surprises</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">(add-to-list 'evil-collection-mode-list 'magit) ;; evilify magit</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">(add-to-list 'evil-collection-mode-list '(pdf pdf-view)) ;; evilify pdf-view</span>
  <span style="color: #f38ba8;">:config</span>
  (evil-collection-init))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbfdb321" class="outline-4">
<h4 id="orgbfdb321"><span class="section-number-4">5.2.2.</span> Evil commentary</h4>
<div class="outline-text-4" id="text-5-2-2">
<p>
Port of Tim Pope's commentary package
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">evil-commentary</span>
  <span style="color: #f38ba8;">:after</span> evil
  <span style="color: #f38ba8;">:config</span>
  (evil-commentary-mode)) <span style="color: #6c7086;">;; </span><span style="color: #505050;">globally enable evil-commentary</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org19a0b68" class="outline-4">
<h4 id="org19a0b68"><span class="section-number-4">5.2.3.</span> Evil surround</h4>
<div class="outline-text-4" id="text-5-2-3">
<p>
Port of Tim Pope's surround package
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">evil-surround</span>
  <span style="color: #f38ba8;">:after</span> evil
  <span style="color: #f38ba8;">:hook</span> ((org-mode . (<span style="color: #cba6f7;">lambda</span> () (<span style="color: #cba6f7;">push</span> '(?~ . (<span style="color: #a6e3a1;">"~"</span> . <span style="color: #a6e3a1;">"~"</span>)) evil-surround-pairs-alist)))
         (org-mode . (<span style="color: #cba6f7;">lambda</span> () (<span style="color: #cba6f7;">push</span> '(?$ . (<span style="color: #a6e3a1;">"</span><span style="color: #ff00ff;">\\</span><span style="color: #ff00ff;">(</span><span style="color: #a6e3a1;">"</span> . <span style="color: #a6e3a1;">"</span><span style="color: #ff00ff;">\\</span><span style="color: #ff00ff;">)</span><span style="color: #a6e3a1;">"</span>)) evil-surround-pairs-alist))))
  <span style="color: #f38ba8;">:config</span>
  (global-evil-surround-mode 1)) <span style="color: #6c7086;">;; </span><span style="color: #505050;">globally enable evil-surround</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga198a7f" class="outline-4">
<h4 id="orga198a7f"><span class="section-number-4">5.2.4.</span> Evil goggles</h4>
<div class="outline-text-4" id="text-5-2-4">
<p>
Show visual hints for evil motions.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">evil-goggles</span>
  <span style="color: #f38ba8;">:config</span>
  (evil-goggles-mode)

  <span style="color: #6c7086;">;; </span><span style="color: #505050;">optionally use diff-mode's faces; as a result, deleted text</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">will be highlighed with `diff-removed` face which is typically</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">some red color (as defined by the color theme)</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">other faces such as `diff-added` will be used for other actions</span>
  (evil-goggles-use-diff-faces))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org944bc3c" class="outline-3">
<h3 id="org944bc3c"><span class="section-number-3">5.3.</span> Avy</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li><a href="https://karthinks.com/software/avy-can-do-anything/">Avy can do anything | Karthinks</a></li>
</ul>

<p>
Super-charged navigaton.
</p>

<p>
Use <code>.</code> after an avy command to trigger <code>embark-act</code> on the selected candidate. 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  (<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">avy</span>
    <span style="color: #f38ba8;">:init</span>
(<span style="color: #cba6f7;">defun</span> <span style="color: #89b4fa;">patrl/avy-action-insert-newline</span> (pt)
      (<span style="color: #cba6f7;">save-excursion</span>
        (goto-char pt)
        (newline))
      (select-window
       (cdr
        (ring-ref avy-ring 0))))
    (<span style="color: #cba6f7;">defun</span> <span style="color: #89b4fa;">patrl/avy-action-kill-whole-line</span> (pt)
      (<span style="color: #cba6f7;">save-excursion</span>
        (goto-char pt)
        (kill-whole-line))
      (select-window
       (cdr
        (ring-ref avy-ring 0))))
    (<span style="color: #cba6f7;">defun</span> <span style="color: #89b4fa;">patrl/avy-action-embark</span> (pt)
      (<span style="color: #cba6f7;">unwind-protect</span>
          (<span style="color: #cba6f7;">save-excursion</span>
            (goto-char pt)
            (embark-act))
        (select-window
         (cdr (ring-ref avy-ring 0))))
      t) <span style="color: #6c7086;">;; </span><span style="color: #505050;">adds an avy action for embark</span>
    <span style="color: #f38ba8;">:general</span>
    (<span style="color: #cba6f7;">general-def</span> '(normal motion)
      <span style="color: #a6e3a1;">"s"</span> 'evil-avy-goto-char-timer
      <span style="color: #a6e3a1;">"f"</span> 'evil-avy-goto-char-in-line
      <span style="color: #a6e3a1;">"gl"</span> 'evil-avy-goto-line <span style="color: #6c7086;">;; </span><span style="color: #505050;">this rules</span>
      <span style="color: #a6e3a1;">";"</span> 'avy-resume)
    <span style="color: #f38ba8;">:config</span>
    (<span style="color: #cba6f7;">setf</span> (alist-get ?. avy-dispatch-alist) 'patrl/avy-action-embark <span style="color: #6c7086;">;; </span><span style="color: #505050;">embark integration</span>
          (alist-get ?i avy-dispatch-alist) 'patrl/avy-action-insert-newline
          (alist-get ?K avy-dispatch-alist) 'patrl/avy-action-kill-whole-line)) <span style="color: #6c7086;">;; </span><span style="color: #505050;">kill lines with avy</span>
</pre>
</div>
</div>
<div id="outline-container-org3c5ed5e" class="outline-4">
<h4 id="org3c5ed5e"><span class="section-number-4">5.3.1.</span> Link hint</h4>
<div class="outline-text-4" id="text-5-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">link-hint</span>
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"l"</span> '(link-hint-open-link <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"open link"</span>))
  <span style="color: #f38ba8;">:config</span>
  (<span style="color: #cba6f7;">setq</span> browse-url-browser-function 'browse-url-firefox)
  (<span style="color: #cba6f7;">setq</span> link-hint-avy-style 'pre))
</pre>
</div>
</div>
</div>
</div>
