readme.org
** Which key
   
Display key bindings.

#+begin_src emacs-lisp
  (use-package which-key
    :after evil
    :init (which-key-mode)
    :config
    (which-key-setup-minibuffer))
#+end_src
      
* Appearance

** Icons

#+begin_src emacs-lisp :tangle init.el
  (use-package all-the-icons)


  ;; prettify dired with icons
  (use-package all-the-icons-dired
    :hook
    (dired-mode . all-the-icons-dired-mode))
#+end_src
 
**  Olivetti

Add some margins (useful for writing prose).

#+begin_src emacs-lisp :tangle init.el
  (use-package olivetti
    :init
    (setq olivetti-body-width 80)
    (setq olivetti-style 'fancy)
    (setq olivetti-minimum-body-width 50))

#+end_src

** Mode line

Minimal mode line.   

#+begin_src emacs-lisp :tangle init.el
  (use-package mood-line
    :config (mood-line-mode))
#+end_src
  
** Fonts

#+begin_src emacs-lisp :tangle init.el
  (defun patrl/setup-font-wolfe ()
      (set-face-attribute 'default nil :font (font-spec :family "Iosevka Comfy Motion" :size 10.0 :weight 'regular))
      (set-face-attribute 'fixed-pitch nil :font (font-spec :family "Iosevka Comfy Motion" :size 10.0 :weight 'regular))
      (set-face-attribute 'variable-pitch nil :font (font-spec :family "Iosevka Etoile" :size 10.0 :weight 'medium))
      (set-fontset-font t 'unicode "JuliaMono"))

  ;; (defun patrl/setup-font-wolfe ()
  ;;   (set-face-attribute 'default nil :font (font-spec :family "Blex Mono Nerd Font" :size 30 :weight 'medium))
  ;;   (set-face-attribute 'fixed-pitch nil :font (font-spec :family "Blex Mono Nerd Font" :size 30 :weight 'medium))
  ;;   (set-face-attribute 'variable-pitch nil :font (font-spec :family "iA Writer Duospace" :size 30 :weight 'medium))
  ;;   (set-fontset-font t 'unicode "DeJa Vu Sans Mono")
  ;;   (set-fontset-font t nil "Twitter Color Emoji"))

  (defun patrl/setup-font-vivacia ()
    (set-face-attribute 'default nil :font (font-spec :family "Iosevka Comfy Motion" :size 10.0 :weight 'regular))
    (set-face-attribute 'fixed-pitch nil :font (font-spec :family "Iosevka Comfy Motion" :size 10.0 :weight 'regular))
    (set-face-attribute 'variable-pitch nil :font (font-spec :family "Iosevka Etoile" :size 10.0 :weight 'medium))
    (set-fontset-font t 'unicode "JuliaMono"))

  (when (string= (system-name) "wolfe")
    (add-hook 'after-init-hook 'patrl/setup-font-wolfe)
    (add-hook 'server-after-make-frame-hook 'patrl/setup-font-wolfe))

  (when (string= (system-name) "vivacia")
    (add-hook 'after-init-hook 'patrl/setup-font-vivacia)
    (add-hook 'server-after-make-frame-hook 'patrl/setup-font-vivacia))
#+end_src

** Themes

Visually distinguish between 'real' buffers and everything else.

#+begin_src emacs-lisp :tangle init.el
  (use-package solaire-mode
    :config
    (solaire-global-mode +1))
#+end_src

Some nice themes:

#+begin_src emacs-lisp :tangle init.el
  (use-package tron-legacy-theme
    :config
    (setq tron-legacy-theme-vivid-cursor t))
#+end_src

#+begin_src emacs-lisp :tangle init.el
    (use-package catppuccin-theme
      :config
      (setq catppuccin-height-title1 1.5)
      (load-theme 'catppuccin t))
#+end_src

#+begin_src emacs-lisp :tangle init.el
  (use-package doom-themes
    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t ; if nil, bold is universally disabled
          doom-themes-enable-italic t)
                                          ; if nil, italics is universally disabled
    ;; (load-theme 'doom-nord t)

    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)
    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config))
#+end_src
   
Visually highlight todo.   

#+begin_src emacs-lisp :tangle init.el
  (use-package hl-todo
    :init
    (global-hl-todo-mode))
#+end_src
  
* Organization

** Buffer management

