docs/index.html
<div id="outline-container-org113d525" class="outline-3">
<h3 id="org113d525"><span class="section-number-3">5.4.</span> Which key</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Display key bindings.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">which-key</span>
  <span style="color: #f38ba8;">:after</span> evil
  <span style="color: #f38ba8;">:init</span> (which-key-mode)
  <span style="color: #f38ba8;">:config</span>
  (which-key-setup-minibuffer))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc6000cb" class="outline-2">
<h2 id="orgc6000cb"><span class="section-number-2">6.</span> Appearance</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org7c643ed" class="outline-3">
<h3 id="org7c643ed"><span class="section-number-3">6.1.</span> Icons</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">all-the-icons</span>)


<span style="color: #6c7086;">;; </span><span style="color: #505050;">prettify dired with icons</span>
(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">all-the-icons-dired</span>
  <span style="color: #f38ba8;">:hook</span>
  (dired-mode . all-the-icons-dired-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org60ef0a9" class="outline-3">
<h3 id="org60ef0a9"><span class="section-number-3">6.2.</span> Olivetti</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Add some margins (useful for writing prose).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">olivetti</span>
  <span style="color: #f38ba8;">:init</span>
  (<span style="color: #cba6f7;">setq</span> olivetti-body-width 80)
  (<span style="color: #cba6f7;">setq</span> olivetti-style 'fancy)
  (<span style="color: #cba6f7;">setq</span> olivetti-minimum-body-width 50))

</pre>
</div>
</div>
</div>
<div id="outline-container-org2f65243" class="outline-3">
<h3 id="org2f65243"><span class="section-number-3">6.3.</span> Mode line</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Minimal mode line.   
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">mood-line</span>
  <span style="color: #f38ba8;">:config</span> (mood-line-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org82c9506" class="outline-3">
<h3 id="org82c9506"><span class="section-number-3">6.4.</span> Fonts</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">defun</span> <span style="color: #89b4fa;">patrl/setup-font-wolfe</span> ()
    (set-face-attribute 'default nil <span style="color: #f38ba8;">:font</span> (font-spec <span style="color: #f38ba8;">:family</span> <span style="color: #a6e3a1;">"Iosevka Comfy Motion"</span> <span style="color: #f38ba8;">:size</span> 10.0 <span style="color: #f38ba8;">:weight</span> 'regular))
    (set-face-attribute 'fixed-pitch nil <span style="color: #f38ba8;">:font</span> (font-spec <span style="color: #f38ba8;">:family</span> <span style="color: #a6e3a1;">"Iosevka Comfy Motion"</span> <span style="color: #f38ba8;">:size</span> 10.0 <span style="color: #f38ba8;">:weight</span> 'regular))
    (set-face-attribute 'variable-pitch nil <span style="color: #f38ba8;">:font</span> (font-spec <span style="color: #f38ba8;">:family</span> <span style="color: #a6e3a1;">"Iosevka Etoile"</span> <span style="color: #f38ba8;">:size</span> 10.0 <span style="color: #f38ba8;">:weight</span> 'medium))
    (set-fontset-font t 'unicode <span style="color: #a6e3a1;">"JuliaMono"</span>))

<span style="color: #6c7086;">;; </span><span style="color: #505050;">(defun patrl/setup-font-wolfe ()</span>
<span style="color: #6c7086;">;;   </span><span style="color: #505050;">(set-face-attribute 'default nil :font (font-spec :family "Blex Mono Nerd Font" :size 30 :weight 'medium))</span>
<span style="color: #6c7086;">;;   </span><span style="color: #505050;">(set-face-attribute 'fixed-pitch nil :font (font-spec :family "Blex Mono Nerd Font" :size 30 :weight 'medium))</span>
<span style="color: #6c7086;">;;   </span><span style="color: #505050;">(set-face-attribute 'variable-pitch nil :font (font-spec :family "iA Writer Duospace" :size 30 :weight 'medium))</span>
<span style="color: #6c7086;">;;   </span><span style="color: #505050;">(set-fontset-font t 'unicode "DeJa Vu Sans Mono")</span>
<span style="color: #6c7086;">;;   </span><span style="color: #505050;">(set-fontset-font t nil "Twitter Color Emoji"))</span>

(<span style="color: #cba6f7;">defun</span> <span style="color: #89b4fa;">patrl/setup-font-vivacia</span> ()
  (set-face-attribute 'default nil <span style="color: #f38ba8;">:font</span> (font-spec <span style="color: #f38ba8;">:family</span> <span style="color: #a6e3a1;">"Iosevka Comfy Motion"</span> <span style="color: #f38ba8;">:size</span> 10.0 <span style="color: #f38ba8;">:weight</span> 'regular))
  (set-face-attribute 'fixed-pitch nil <span style="color: #f38ba8;">:font</span> (font-spec <span style="color: #f38ba8;">:family</span> <span style="color: #a6e3a1;">"Iosevka Comfy Motion"</span> <span style="color: #f38ba8;">:size</span> 10.0 <span style="color: #f38ba8;">:weight</span> 'regular))
  (set-face-attribute 'variable-pitch nil <span style="color: #f38ba8;">:font</span> (font-spec <span style="color: #f38ba8;">:family</span> <span style="color: #a6e3a1;">"Iosevka Etoile"</span> <span style="color: #f38ba8;">:size</span> 10.0 <span style="color: #f38ba8;">:weight</span> 'medium))
  (set-fontset-font t 'unicode <span style="color: #a6e3a1;">"JuliaMono"</span>))

(<span style="color: #cba6f7;">when</span> (string= (system-name) <span style="color: #a6e3a1;">"wolfe"</span>)
  (add-hook 'after-init-hook 'patrl/setup-font-wolfe)
  (add-hook 'server-after-make-frame-hook 'patrl/setup-font-wolfe))

(<span style="color: #cba6f7;">when</span> (string= (system-name) <span style="color: #a6e3a1;">"vivacia"</span>)
  (add-hook 'after-init-hook 'patrl/setup-font-vivacia)
  (add-hook 'server-after-make-frame-hook 'patrl/setup-font-vivacia))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcf7ad45" class="outline-3">
<h3 id="orgcf7ad45"><span class="section-number-3">6.5.</span> Themes</h3>
<div class="outline-text-3" id="text-6-5">
<p>
Visually distinguish between 'real' buffers and everything else.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">solaire-mode</span>
  <span style="color: #f38ba8;">:config</span>
  (solaire-global-mode +1))
</pre>
</div>

<p>
Some nice themes:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">tron-legacy-theme</span>
  <span style="color: #f38ba8;">:config</span>
  (<span style="color: #cba6f7;">setq</span> tron-legacy-theme-vivid-cursor t))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">catppuccin-theme</span>
  <span style="color: #f38ba8;">:config</span>
  (<span style="color: #cba6f7;">setq</span> catppuccin-height-title1 1.5)
  (load-theme 'catppuccin t))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">doom-themes</span>
  <span style="color: #f38ba8;">:config</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">Global settings (defaults)</span>
  (<span style="color: #cba6f7;">setq</span> doom-themes-enable-bold t <span style="color: #6c7086;">; </span><span style="color: #505050;">if nil, bold is universally disabled</span>
        doom-themes-enable-italic t)
                                        <span style="color: #6c7086;">; </span><span style="color: #505050;">if nil, italics is universally disabled</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">(load-theme 'doom-nord t)</span>

  <span style="color: #6c7086;">;; </span><span style="color: #505050;">Enable flashing mode-line on errors</span>
  (doom-themes-visual-bell-config)
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">Corrects (and improves) org-mode's native fontification.</span>
  (doom-themes-org-config))
</pre>
</div>

<p>
Visually highlight todo.   
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">hl-todo</span>
  <span style="color: #f38ba8;">:init</span>
  (global-hl-todo-mode))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org889fb8f" class="outline-2">
<h2 id="org889fb8f"><span class="section-number-2">7.</span> Organization</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org93b7689" class="outline-3">
<h3 id="org93b7689"><span class="section-number-3">7.1.</span> Buffer management</h3>
<div class="outline-text-3" id="text-7-1">
</div>
