readme.org
*** ~Popper~

Classify certain buffer types as popups.

Not sure if I want to keep this around.

#+begin_src emacs-lisp :tangle init.el
  (use-package popper
    :general
    (patrl/leader-keys
          "bp" '(:ignore t :wk "popper")
          "bpc" '(popper-cycle t :wk "cycle")
          "bpt" '(popper-toggle-latest t :wk "toggle latest")
          "bpb" '(popper-toggle-type t :wk "toggle type")
          "bpk" '(popper-kill-latest-popup t :wk "kill latest"))
    :init
    (setq popper-reference-buffers
          '("\\*Messages\\*"
            "Output\\*$"
            "\\*helpful"
            "\\*Async Shell Command\\*"
            help-mode
            compilation-mode
            magit-process-mode
            "^\\*eshell.*\\*" eshell-mode
            "\\*direnv\\*"
            "\\*elfeed-log\\*"
            "\\*straight-process\\*"
            "\\*Async-native-compile-log\\*"
            "\\*TeX Help\\*"
            "\\*Embark Collect Live\\*"))
    (popper-mode +1)
    (popper-echo-mode +1))
#+end_src

**** ~bufler~

This has been quite nice so far.

#+begin_src emacs-lisp :tangle init.el
  (use-package bufler
    :custom
    (bufler-workspace-mode t)
    ;; (bufler-workspace-tabs-mode t)
    :general
    (patrl/leader-keys
      "bB" '(bufler :wk "bufler") ;; overrides consult
      "bf" '(bufler-workspace-frame-set :wk "bufler workspace frame set") 
      "bl" '(bufler-list :wk "bufler list"))
    (:keymaps 'bufler-list-mode-map
              :states 'normal
              "?" 'hydra:bufler/body
              "RET" 'bufler-list-buffer-switch
              "SPC" 'bufler-list-buffer-peek
              "d" 'bufler-list-buffer-kill))
#+end_src

**** Projects

Use built in ~project.el~.
  
#+begin_src emacs-lisp :tangle init.el 
  (use-package project
    :general
    ;; assign built-in project.el bindings a new prefix
    (patrl/leader-keys "p" '(:keymap project-prefix-map :wk "project"))
    :straight (:type built-in))
#+end_src

**** File management

Use built-in ~dired~.

#+begin_src emacs-lisp :tangle init.el
  (use-package dired
    :general
    (patrl/leader-keys
      "fd" '(dired :wk "dired") ;; open dired (in a directory)
      "fj" '(dired-jump :wk "dired jump")) ;; open direct in the current directory
    ;; ranger like navigation
    (:keymaps 'dired-mode-map
              :states 'normal
              "h" 'dired-up-directory
              "q" 'kill-current-buffer
              "l" 'dired-find-file)
    :hook
    (dired-mode . dired-hide-details-mode) ;; make dired prettier
    :straight (:type built-in))

  ;; toggle subtree visibility with 'TAB'
  ;; makes dired a much more pleasant file manager
  (use-package dired-subtree)
#+end_src
  
* Languages

** Lua

#+begin_src emacs-lisp :tangle init.el
  (use-package lua-mode
    :mode "\\.lua\\'")
#+end_src

** Lisp

*** Fennel

#+begin_src emacs-lisp :tangle init.el
  (use-package fennel-mode
   :mode "\\.fnl\\'")
#+end_src

*** Sly

#+begin_src emacs-lisp :tangle init.el
  ;; FIXME - compatibility with corfu
  (use-package sly)
#+end_src

*** lispy

#+begin_src emacs-lisp :tangle init.el
  (use-package lispy
    :general
    (:keymaps 'lispy-mode-map 
	      "TAB" 'indent-for-tab-command) ;; necessary for 'corfu'
    :hook
    (emacs-lisp-mode . lispy-mode)
    (racket-mode . lispy-mode)
    (fennel-mode . lispy-mode))

  (use-package lispyville
    :hook (lispy-mode . lispyville-mode)
    :general
    (:keymaps 'lispyville-mode-map
	      "TAB" 'indent-for-tab-command) ;; necessary for 'corfu'
    ;; the following is necessary to retain tab completion in lispy mode 
    :config
    ;; TODO play around with keythemes 
    (lispyville-set-key-theme '(operators c-w additional)))
#+end_src

**** TODO add additional key themes for lispyville

** Org 

