docs/index.html
<div id="outline-container-orgdad1f50" class="outline-4">
<h4 id="orgdad1f50"><span class="section-number-4">7.1.1.</span> <code>Popper</code></h4>
<div class="outline-text-4" id="text-7-1-1">
<p>
Classify certain buffer types as popups.
</p>

<p>
Not sure if I want to keep this around.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">popper</span>
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
        <span style="color: #a6e3a1;">"bp"</span> '(<span style="color: #f38ba8;">:ignore</span> t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"popper"</span>)
        <span style="color: #a6e3a1;">"bpc"</span> '(popper-cycle t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"cycle"</span>)
        <span style="color: #a6e3a1;">"bpt"</span> '(popper-toggle-latest t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"toggle latest"</span>)
        <span style="color: #a6e3a1;">"bpb"</span> '(popper-toggle-type t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"toggle type"</span>)
        <span style="color: #a6e3a1;">"bpk"</span> '(popper-kill-latest-popup t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"kill latest"</span>))
  <span style="color: #f38ba8;">:init</span>
  (<span style="color: #cba6f7;">setq</span> popper-reference-buffers
        '(<span style="color: #a6e3a1;">"\\*Messages\\*"</span>
          <span style="color: #a6e3a1;">"Output\\*$"</span>
          <span style="color: #a6e3a1;">"\\*helpful"</span>
          <span style="color: #a6e3a1;">"\\*Async Shell Command\\*"</span>
          help-mode
          compilation-mode
          magit-process-mode
          <span style="color: #a6e3a1;">"^\\*eshell.*\\*"</span> eshell-mode
          <span style="color: #a6e3a1;">"\\*direnv\\*"</span>
          <span style="color: #a6e3a1;">"\\*elfeed-log\\*"</span>
          <span style="color: #a6e3a1;">"\\*straight-process\\*"</span>
          <span style="color: #a6e3a1;">"\\*Async-native-compile-log\\*"</span>
          <span style="color: #a6e3a1;">"\\*TeX Help\\*"</span>
          <span style="color: #a6e3a1;">"\\*Embark Collect Live\\*"</span>))
  (popper-mode +1)
  (popper-echo-mode +1))
</pre>
</div>
</div>
<ol class="org-ol">
<li><a id="org047c65e"></a><code>bufler</code><br />
<div class="outline-text-5" id="text-7-1-1-1">
<p>
This has been quite nice so far.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">bufler</span>
  <span style="color: #f38ba8;">:custom</span>
  (bufler-workspace-mode t)
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">(bufler-workspace-tabs-mode t)</span>
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"bB"</span> '(bufler <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"bufler"</span>) <span style="color: #6c7086;">;; </span><span style="color: #505050;">overrides consult</span>
    <span style="color: #a6e3a1;">"bf"</span> '(bufler-workspace-frame-set <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"bufler workspace frame set"</span>) 
    <span style="color: #a6e3a1;">"bl"</span> '(bufler-list <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"bufler list"</span>))
  (<span style="color: #f38ba8;">:keymaps</span> 'bufler-list-mode-map
            <span style="color: #f38ba8;">:states</span> 'normal
            <span style="color: #a6e3a1;">"?"</span> 'hydra:bufler/body
            <span style="color: #a6e3a1;">"RET"</span> 'bufler-list-buffer-switch
            <span style="color: #a6e3a1;">"SPC"</span> 'bufler-list-buffer-peek
            <span style="color: #a6e3a1;">"d"</span> 'bufler-list-buffer-kill))
</pre>
</div>
</div>
</li>
<li><a id="org9186c06"></a>Projects<br />
<div class="outline-text-5" id="text-7-1-1-2">
<p>
Use built in <code>project.el</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">project</span>
  <span style="color: #f38ba8;">:general</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">assign built-in project.el bindings a new prefix</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span> <span style="color: #a6e3a1;">"p"</span> '(<span style="color: #f38ba8;">:keymap</span> project-prefix-map <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"project"</span>))
  <span style="color: #f38ba8;">:straight</span> (<span style="color: #f38ba8;">:type</span> built-in))
</pre>
</div>
</div>
</li>
<li><a id="org961b06f"></a>File management<br />
<div class="outline-text-5" id="text-7-1-1-3">
<p>
Use built-in <code>dired</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">dired</span>
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"fd"</span> '(dired <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"dired"</span>) <span style="color: #6c7086;">;; </span><span style="color: #505050;">open dired (in a directory)</span>
    <span style="color: #a6e3a1;">"fj"</span> '(dired-jump <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"dired jump"</span>)) <span style="color: #6c7086;">;; </span><span style="color: #505050;">open direct in the current directory</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">ranger like navigation</span>
  (<span style="color: #f38ba8;">:keymaps</span> 'dired-mode-map
            <span style="color: #f38ba8;">:states</span> 'normal
            <span style="color: #a6e3a1;">"h"</span> 'dired-up-directory
            <span style="color: #a6e3a1;">"q"</span> 'kill-current-buffer
            <span style="color: #a6e3a1;">"l"</span> 'dired-find-file)
  <span style="color: #f38ba8;">:hook</span>
  (dired-mode . dired-hide-details-mode) <span style="color: #6c7086;">;; </span><span style="color: #505050;">make dired prettier</span>
  <span style="color: #f38ba8;">:straight</span> (<span style="color: #f38ba8;">:type</span> built-in))

<span style="color: #6c7086;">;; </span><span style="color: #505050;">toggle subtree visibility with '</span><span style="color: #fab387;">TAB</span><span style="color: #505050;">'</span>
<span style="color: #6c7086;">;; </span><span style="color: #505050;">makes dired a much more pleasant file manager</span>
(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">dired-subtree</span>)
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org1772ecd" class="outline-2">
<h2 id="org1772ecd"><span class="section-number-2">8.</span> Languages</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org70e621e" class="outline-3">
<h3 id="org70e621e"><span class="section-number-3">8.1.</span> Lua</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">lua-mode</span>
  <span style="color: #f38ba8;">:mode</span> <span style="color: #a6e3a1;">"\\.lua\\'"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb0e2d9f" class="outline-3">
<h3 id="orgb0e2d9f"><span class="section-number-3">8.2.</span> Lisp</h3>
<div class="outline-text-3" id="text-8-2">
</div>
<div id="outline-container-orgdd6f90f" class="outline-4">
<h4 id="orgdd6f90f"><span class="section-number-4">8.2.1.</span> Fennel</h4>
<div class="outline-text-4" id="text-8-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">fennel-mode</span>
 <span style="color: #f38ba8;">:mode</span> <span style="color: #a6e3a1;">"\\.fnl\\'"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org65d27f9" class="outline-4">
<h4 id="org65d27f9"><span class="section-number-4">8.2.2.</span> Sly</h4>
<div class="outline-text-4" id="text-8-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #6c7086;">;; </span><span style="color: #a0132f; font-weight: bold;">FIXME</span><span style="color: #505050;"> - compatibility with corfu</span>
(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">sly</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org398ab35" class="outline-4">
<h4 id="org398ab35"><span class="section-number-4">8.2.3.</span> lispy</h4>
<div class="outline-text-4" id="text-8-2-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">lispy</span>
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #f38ba8;">:keymaps</span> 'lispy-mode-map 
              <span style="color: #a6e3a1;">"TAB"</span> 'indent-for-tab-command) <span style="color: #6c7086;">;; </span><span style="color: #505050;">necessary for '</span><span style="color: #fab387;">corfu</span><span style="color: #505050;">'</span>
  <span style="color: #f38ba8;">:hook</span>
  (emacs-lisp-mode . lispy-mode)
  (racket-mode . lispy-mode)
  (fennel-mode . lispy-mode))

(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">lispyville</span>
  <span style="color: #f38ba8;">:hook</span> (lispy-mode . lispyville-mode)
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #f38ba8;">:keymaps</span> 'lispyville-mode-map
              <span style="color: #a6e3a1;">"TAB"</span> 'indent-for-tab-command) <span style="color: #6c7086;">;; </span><span style="color: #505050;">necessary for '</span><span style="color: #fab387;">corfu</span><span style="color: #505050;">'</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">the following is necessary to retain tab completion in lispy mode </span>
  <span style="color: #f38ba8;">:config</span>
  <span style="color: #6c7086;">;; </span><span style="color: #721045; font-weight: bold;">TODO</span><span style="color: #505050;"> play around with keythemes </span>
  (lispyville-set-key-theme '(operators c-w additional)))
</pre>
</div>
</div>
<ol class="org-ol">
<li><a id="orgcbb9f55"></a><span class="todo TODO">TODO</span> add additional key themes for lispyville<br /></li>
</ol>
</div>
</div>
