readme.org
*** Org mode

Resources:
- [[https://zzamboni.org/post/beautifying-org-mode-in-emacs/][zzamboni.org | Beautifying Org Mode in Emacs]]
- [[https://lepisma.xyz/2017/10/28/ricing-org-mode/][Ricing up Org Mode]]
- [[https://github.com/minad/org-modern][GitHub - minad/org-modern: Modern Org Style]]

  #+begin_src emacs-lisp :tangle init.el
    (use-package org
      ;; :straight (:type built-in)
      :init
      ;; edit settings
      (setq org-auto-align-tags nil
	    org-tags-column 0
	    org-catch-invisible-edits 'show-and-error
	    org-special-ctrl-a/e t ;; special navigation behaviour in headlines
	    org-insert-heading-respect-content t)

      ;; styling, hide markup, etc.
      (setq org-hide-emphasis-markers t
	    org-src-fontify-natively t ;; fontify source blocks natively
	    org-highlight-latex-and-related '(native) ;; fontify latex blocks natively
	    org-pretty-entities t
	    org-ellipsis "…")

      ;; agenda styling
      (setq org-agenda-tags-column 0
	    org-agenda-block-separator ?─
	    org-agenda-time-grid
	    '((daily today require-timed)
	      (800 1000 1200 1400 1600 1800 2000)
	      " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
	    org-agenda-current-time-string
	    "⭠ now ─────────────────────────────────────────────────")

      ;; todo setup
      (setq org-todo-keywords
	    ;; it's extremely useful to distinguish between short-term goals and long-term projects
	    '((sequence "TODO(t)" "SOMEDAY(s)" "|" "DONE(d)")
	      (sequence "TO-READ(r)" "READING(R)" "|" "HAVE-READ(d)")
	      (sequence "PROJ(p)" "|" "COMPLETED(c)")))


      (setq org-adapt-indentation nil) ;; interacts poorly with 'evil-open-below'

      :custom
      (org-agenda-files '("~/notes/todo.org" "~/notes/teaching.org" "~/notes/projects.org"))
      (org-cite-global-bibliography '("~/repos/bibliography/master.bib"))
      :general
      (patrl/local-leader-keys
	:keymaps 'org-mode-map
	"a" '(org-archive-subtree :wk "archive")
	"l" '(:ignore t :wk "link")
	"ll" '(org-insert-link t :wk "link")
	"lp" '(org-latex-preview t :wk "prev latex")
	"h" '(consult-org-heading :wk "consult heading")
	"d" '(org-cut-special :wk "org cut special")
	"y" '(org-copy-special :wk "org copy special")
	"p" '(org-paste-special :wk "org paste special")
	"b" '(:keymap org-babel-map :wk "babel")
	"t" '(org-todo :wk "todo")
	"s" '(org-insert-structure-template :wk "template")
	"e" '(org-edit-special :wk "edit")
	"i" '(:ignore t :wk "insert")
	"ih" '(org-insert-heading :wk "insert heading")
	"is" '(org-insert-subheading :wk "insert heading")
	"f" '(org-footnote-action :wk "footnote action")
	">" '(org-demote-subtree :wk "demote subtree")
	"<" '(org-promote-subtree :wk "demote subtree"))
      (:keymaps 'org-agenda-mode-map
		"j" '(org-agenda-next-line)
		"h" '(org-agenda-previous-line))

      :hook
      (org-mode . olivetti-mode)
      (org-mode . variable-pitch-mode)
      (org-mode . (lambda () (electric-indent-local-mode -1))) ;; disable electric indentation

      :config
      (add-to-list 'org-latex-packages-alist '("" "braket" t))
      (org-babel-do-load-languages
       'org-babel-load-languages
       '((js . t)
	 (emacs-lisp . t)
	 (awk . t)))
      ;; set up org paths
      (setq org-directory "~/Dropbox (MIT)/org/agenda")
      (setq org-default-notes-file (concat org-directory "/notes.org")))
  #+end_src
  
*** Evil integration

#+begin_src emacs-lisp :tangle init.el
  (use-package evil-org
    :after org
    :hook (org-mode . (lambda () evil-org-mode))
    :config
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys))
#+end_src

*** Org-auctex

Provides faster latex previews for ~org-mode~. 

- [[https://github.com/karthink/org-auctex][GitHub - karthink/org-auctex: Better latex previews for org-mode]]
- See https://karthinks.com/software/fast-latex-previews-in-org-mode/
  
#+begin_src emacs-lisp :tangle init.el
  (use-package org-auctex
    :straight (:type git :host github :repo
                     "karthink/org-auctex")
    :hook (org-mode . org-auctex-mode))
#+end_src

