docs/index.html
<div id="outline-container-org5f6f221" class="outline-3">
<h3 id="org5f6f221"><span class="section-number-3">8.3.</span> Org</h3>
<div class="outline-text-3" id="text-8-3">
</div>
<div id="outline-container-org3e9e791" class="outline-4">
<h4 id="org3e9e791"><span class="section-number-4">8.3.1.</span> Org mode</h4>
<div class="outline-text-4" id="text-8-3-1">
<p>
Resources:
</p>
<ul class="org-ul">
<li><a href="https://zzamboni.org/post/beautifying-org-mode-in-emacs/">zzamboni.org | Beautifying Org Mode in Emacs</a></li>
<li><a href="https://lepisma.xyz/2017/10/28/ricing-org-mode/">Ricing up Org Mode</a></li>
<li><p>
<a href="https://github.com/minad/org-modern">GitHub - minad/org-modern: Modern Org Style</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">org</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">:straight (:type built-in)</span>
  <span style="color: #f38ba8;">:init</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">edit settings</span>
  (<span style="color: #cba6f7;">setq</span> org-auto-align-tags nil
            org-tags-column 0
            org-catch-invisible-edits 'show-and-error
            org-special-ctrl-a/e t <span style="color: #6c7086;">;; </span><span style="color: #505050;">special navigation behaviour in headlines</span>
            org-insert-heading-respect-content t)

  <span style="color: #6c7086;">;; </span><span style="color: #505050;">styling, hide markup, etc.</span>
  (<span style="color: #cba6f7;">setq</span> org-hide-emphasis-markers t
            org-src-fontify-natively t <span style="color: #6c7086;">;; </span><span style="color: #505050;">fontify source blocks natively</span>
            org-highlight-latex-and-related '(native) <span style="color: #6c7086;">;; </span><span style="color: #505050;">fontify latex blocks natively</span>
            org-pretty-entities t
            org-ellipsis <span style="color: #a6e3a1;">"&#8230;"</span>)

  <span style="color: #6c7086;">;; </span><span style="color: #505050;">agenda styling</span>
  (<span style="color: #cba6f7;">setq</span> org-agenda-tags-column 0
            org-agenda-block-separator ?&#9472;
            org-agenda-time-grid
            '((daily today require-timed)
              (800 1000 1200 1400 1600 1800 2000)
              <span style="color: #a6e3a1;">" &#9476;&#9476;&#9476;&#9476;&#9476; "</span> <span style="color: #a6e3a1;">"&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;"</span>)
            org-agenda-current-time-string
            <span style="color: #a6e3a1;">"&#11104; now &#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;"</span>)

  <span style="color: #6c7086;">;; </span><span style="color: #505050;">todo setup</span>
  (<span style="color: #cba6f7;">setq</span> org-todo-keywords
            <span style="color: #6c7086;">;; </span><span style="color: #505050;">it's extremely useful to distinguish between short-term goals and long-term projects</span>
            '((sequence <span style="color: #a6e3a1;">"</span><span style="color: #721045; font-weight: bold;">TODO</span><span style="color: #a6e3a1;">(t)"</span> <span style="color: #a6e3a1;">"SOMEDAY(s)"</span> <span style="color: #a6e3a1;">"|"</span> <span style="color: #a6e3a1;">"</span><span style="color: #005e00; font-weight: bold;">DONE</span><span style="color: #a6e3a1;">(d)"</span>)
              (sequence <span style="color: #a6e3a1;">"TO-READ(r)"</span> <span style="color: #a6e3a1;">"READING(R)"</span> <span style="color: #a6e3a1;">"|"</span> <span style="color: #a6e3a1;">"HAVE-READ(d)"</span>)
              (sequence <span style="color: #a6e3a1;">"PROJ(p)"</span> <span style="color: #a6e3a1;">"|"</span> <span style="color: #a6e3a1;">"COMPLETED(c)"</span>)))


  (<span style="color: #cba6f7;">setq</span> org-adapt-indentation nil) <span style="color: #6c7086;">;; </span><span style="color: #505050;">interacts poorly with '</span><span style="color: #fab387;">evil-open-below</span><span style="color: #505050;">'</span>

  <span style="color: #f38ba8;">:custom</span>
  (org-agenda-files '(<span style="color: #a6e3a1;">"~/notes/todo.org"</span> <span style="color: #a6e3a1;">"~/notes/teaching.org"</span> <span style="color: #a6e3a1;">"~/notes/projects.org"</span>))
  (org-cite-global-bibliography '(<span style="color: #a6e3a1;">"~/repos/bibliography/master.bib"</span>))
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/local-leader-keys</span>
        <span style="color: #f38ba8;">:keymaps</span> 'org-mode-map
        <span style="color: #a6e3a1;">"a"</span> '(org-archive-subtree <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"archive"</span>)
        <span style="color: #a6e3a1;">"l"</span> '(<span style="color: #f38ba8;">:ignore</span> t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"link"</span>)
        <span style="color: #a6e3a1;">"ll"</span> '(org-insert-link t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"link"</span>)
        <span style="color: #a6e3a1;">"lp"</span> '(org-latex-preview t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"prev latex"</span>)
        <span style="color: #a6e3a1;">"h"</span> '(consult-org-heading <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"consult heading"</span>)
        <span style="color: #a6e3a1;">"d"</span> '(org-cut-special <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"org cut special"</span>)
        <span style="color: #a6e3a1;">"y"</span> '(org-copy-special <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"org copy special"</span>)
        <span style="color: #a6e3a1;">"p"</span> '(org-paste-special <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"org paste special"</span>)
        <span style="color: #a6e3a1;">"b"</span> '(<span style="color: #f38ba8;">:keymap</span> org-babel-map <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"babel"</span>)
        <span style="color: #a6e3a1;">"t"</span> '(org-todo <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"todo"</span>)
        <span style="color: #a6e3a1;">"s"</span> '(org-insert-structure-template <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"template"</span>)
        <span style="color: #a6e3a1;">"e"</span> '(org-edit-special <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"edit"</span>)
        <span style="color: #a6e3a1;">"i"</span> '(<span style="color: #f38ba8;">:ignore</span> t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"insert"</span>)
        <span style="color: #a6e3a1;">"ih"</span> '(org-insert-heading <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"insert heading"</span>)
        <span style="color: #a6e3a1;">"is"</span> '(org-insert-subheading <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"insert heading"</span>)
        <span style="color: #a6e3a1;">"f"</span> '(org-footnote-action <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"footnote action"</span>)
        <span style="color: #a6e3a1;">"&gt;"</span> '(org-demote-subtree <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"demote subtree"</span>)
        <span style="color: #a6e3a1;">"&lt;"</span> '(org-promote-subtree <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"demote subtree"</span>))
  (<span style="color: #f38ba8;">:keymaps</span> 'org-agenda-mode-map
                <span style="color: #a6e3a1;">"j"</span> '(org-agenda-next-line)
                <span style="color: #a6e3a1;">"h"</span> '(org-agenda-previous-line))

  <span style="color: #f38ba8;">:hook</span>
  (org-mode . olivetti-mode)
  (org-mode . variable-pitch-mode)
  (org-mode . (<span style="color: #cba6f7;">lambda</span> () (electric-indent-local-mode -1))) <span style="color: #6c7086;">;; </span><span style="color: #505050;">disable electric indentation</span>

  <span style="color: #f38ba8;">:config</span>
  (add-to-list 'org-latex-packages-alist '(<span style="color: #a6e3a1;">""</span> <span style="color: #a6e3a1;">"braket"</span> t))
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((js . t)
         (emacs-lisp . t)
         (awk . t)))
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">set up org paths</span>
  (<span style="color: #cba6f7;">setq</span> org-directory <span style="color: #a6e3a1;">"~/Dropbox (MIT)/org/agenda"</span>)
  (<span style="color: #cba6f7;">setq</span> org-default-notes-file (concat org-directory <span style="color: #a6e3a1;">"/notes.org"</span>)))
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org60c840e" class="outline-4">
<h4 id="org60c840e"><span class="section-number-4">8.3.2.</span> Evil integration</h4>
<div class="outline-text-4" id="text-8-3-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">evil-org</span>
  <span style="color: #f38ba8;">:after</span> org
  <span style="color: #f38ba8;">:hook</span> (org-mode . (<span style="color: #cba6f7;">lambda</span> () evil-org-mode))
  <span style="color: #f38ba8;">:config</span>
  (<span style="color: #cba6f7;">require</span> '<span style="color: #fab387;">evil-org-agenda</span>)
  (evil-org-agenda-set-keys))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd116aab" class="outline-4">
<h4 id="orgd116aab"><span class="section-number-4">8.3.3.</span> Org-auctex</h4>
<div class="outline-text-4" id="text-8-3-3">
<p>
Provides faster latex previews for <code>org-mode</code>. 
</p>

<ul class="org-ul">
<li><a href="https://github.com/karthink/org-auctex">GitHub - karthink/org-auctex: Better latex previews for org-mode</a></li>
<li>See <a href="https://karthinks.com/software/fast-latex-previews-in-org-mode/">https://karthinks.com/software/fast-latex-previews-in-org-mode/</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">org-auctex</span>
  <span style="color: #f38ba8;">:straight</span> (<span style="color: #f38ba8;">:type</span> git <span style="color: #f38ba8;">:host</span> github <span style="color: #f38ba8;">:repo</span>
                   <span style="color: #a6e3a1;">"karthink/org-auctex"</span>)
  <span style="color: #f38ba8;">:hook</span> (org-mode . org-auctex-mode))
</pre>
</div>
</div>
</div>
