readme.org
*** Transclusion

#+begin_src emacs-lisp :tangle init.el
  (use-package org-transclusion
    :after org
    :general
    (patrl/leader-keys
      "nt" '(org-transclusion-mode :wk "transclusion mode")))
#+end_src

*** Appear

Reveals hidden elements interactively.

#+begin_src emacs-lisp :tangle init.el
  (use-package org-appear
    :straight (:type git :host github :repo "awth13/org-appear")
    :after org
    :hook (org-mode . org-appear-mode))
#+end_src

***  Cliplink 

#+begin_src emacs-lisp :tangle init.el
  (use-package org-cliplink
    :after org
    :general
    (patrl/local-leader-keys
      :keymaps 'org-mode-map 
      "lc" '(org-cliplink :wk "cliplink")))
#+end_src
   
*** Org modern 

Enable org-modern mode globally.

#+begin_src emacs-lisp :tangle init.el
  (use-package org-modern
    :after org
    :config (global-org-modern-mode))
#+end_src
   
*** Org roam

#+begin_src emacs-lisp :tangle init.el
  (use-package org-roam
    :general
    (patrl/leader-keys
      "nr" '(:ignore t :wk "roam")
      "nri" '(org-roam-node-insert t :wk "insert node")
      "nrt" '(org-roam-buffer-toggle t :wk "roam buffer toggle")
      "nrc" '(org-roam-capture t :wk "roam capture")
      "nrf" '(org-roam-node-find :wk "find node")
      "nrd" '(:ignore t :wk "dailies")
      "nrdt" '(org-roam-dailies-goto-today :wk "today")
      "nrdt" '(org-roam-dailies-goto-yesterday :wk "today")
      "nrdT" '(org-roam-dailies-goto-tomorrow :wk "today")
      "nrdd" '(org-roam-dailies-goto-date :wk "goto date"))
    :config
    ;; org-roam-buffer
    (add-to-list 'display-buffer-alist
                 '("\\*org-roam\\*"
                   (display-buffer-in-direction)
                   (direction . right)
                   (window-width . 0.33)
                   (window-height . fit-window-to-buffer)))
    ;; get tags to show up in 'org-roam-node-find':
    (setq org-roam-node-display-template
          (concat "${title:*} "
                  (propertize "${tags:10}" 'face 'org-tag)))
    (setq org-roam-completion-everywhere t) ;; roam completion anywhere
    (setq org-roam-directory patrl/notes-path)
    (setq org-roam-db-location (concat org-roam-directory "/.database/org-roam.db"))
    (org-roam-db-autosync-mode) ;; ensures that org-roam is available on startup

    ;; dailies config
    (setq org-roam-dailies-directory "daily/")
    (setq org-roam-dailies-capture-templates
          '(("d" "default" entry
             "* %?"
             :target (file+head "%<%Y-%m-%d>.org"
                                "#+title: %<%Y-%m-%d>\n#+filetags: daily\n")))))
#+end_src

*** Export 

#+begin_src emacs-lisp :tangle init.el
  (use-package citeproc
    :after org)

  (with-eval-after-load 'ox-latex
     (add-to-list 'org-latex-classes
                  '("scrartcl"
                    "\\documentclass[letterpaper]{scrartcl}"
                    ("\\section{%s}" . "\\section*{%s}")
                    ("\\subsection{%s}" . "\\subsection*{%s}")
                    ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                    ("\\paragraph{%s}" . "\\paragraph*{%s}")
                    ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))

#+end_src

*** Highlighting

#+begin_src emacs-lisp :tangle init.el
  (use-package htmlize)
#+end_src

*** Org-noter

#+begin_src emacs-lisp :tangle init.el 
    (use-package org-noter
      :commands
      org-noter
      :general
      (patrl/local-leader-keys
        :keyamps 'org-noter-doc-mode-map
        "i" 'org-noter-insert-note)
      :config
      (setq org-noter-notes-search-path (list patrl/notes-path))
      (setq org-noter-default-notes-file-names '("literature-notes.org"))
      (setq org-noter-hide-other nil)
      (setq org-noter-always-create-frame nil))
#+end_src

** js

#+begin_src emacs-lisp :tangle init.el
  (use-package js2-mode)
#+end_src

** Rust

We'll use ~rust-analyzer~ by using ~rustic~ with eglot.

#+begin_src emacs-lisp :tangle init.el
  (use-package rustic
    :mode ("\\.rs\\'" . rustic-mode)
    :config (setq rustic-lsp-client 'eglot))
#+end_src

