docs/index.html
<div id="outline-container-org4af1644" class="outline-4">
<h4 id="org4af1644"><span class="section-number-4">8.3.4.</span> Transclusion</h4>
<div class="outline-text-4" id="text-8-3-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">org-transclusion</span>
  <span style="color: #f38ba8;">:after</span> org
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"nt"</span> '(org-transclusion-mode <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"transclusion mode"</span>)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org4e0ee00" class="outline-4">
<h4 id="org4e0ee00"><span class="section-number-4">8.3.5.</span> Appear</h4>
<div class="outline-text-4" id="text-8-3-5">
<p>
Reveals hidden elements interactively.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">org-appear</span>
  <span style="color: #f38ba8;">:straight</span> (<span style="color: #f38ba8;">:type</span> git <span style="color: #f38ba8;">:host</span> github <span style="color: #f38ba8;">:repo</span> <span style="color: #a6e3a1;">"awth13/org-appear"</span>)
  <span style="color: #f38ba8;">:after</span> org
  <span style="color: #f38ba8;">:hook</span> (org-mode . org-appear-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org27fbb7f" class="outline-4">
<h4 id="org27fbb7f"><span class="section-number-4">8.3.6.</span> Cliplink</h4>
<div class="outline-text-4" id="text-8-3-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">org-cliplink</span>
  <span style="color: #f38ba8;">:after</span> org
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/local-leader-keys</span>
    <span style="color: #f38ba8;">:keymaps</span> 'org-mode-map 
    <span style="color: #a6e3a1;">"lc"</span> '(org-cliplink <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"cliplink"</span>)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org018d75c" class="outline-4">
<h4 id="org018d75c"><span class="section-number-4">8.3.7.</span> Org modern</h4>
<div class="outline-text-4" id="text-8-3-7">
<p>
Enable org-modern mode globally.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">org-modern</span>
  <span style="color: #f38ba8;">:after</span> org
  <span style="color: #f38ba8;">:config</span> (global-org-modern-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-orge41b24b" class="outline-4">
<h4 id="orge41b24b"><span class="section-number-4">8.3.8.</span> Org roam</h4>
<div class="outline-text-4" id="text-8-3-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">org-roam</span>
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"nr"</span> '(<span style="color: #f38ba8;">:ignore</span> t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"roam"</span>)
    <span style="color: #a6e3a1;">"nri"</span> '(org-roam-node-insert t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"insert node"</span>)
    <span style="color: #a6e3a1;">"nrt"</span> '(org-roam-buffer-toggle t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"roam buffer toggle"</span>)
    <span style="color: #a6e3a1;">"nrc"</span> '(org-roam-capture t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"roam capture"</span>)
    <span style="color: #a6e3a1;">"nrf"</span> '(org-roam-node-find <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"find node"</span>)
    <span style="color: #a6e3a1;">"nrd"</span> '(<span style="color: #f38ba8;">:ignore</span> t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"dailies"</span>)
    <span style="color: #a6e3a1;">"nrdt"</span> '(org-roam-dailies-goto-today <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"today"</span>)
    <span style="color: #a6e3a1;">"nrdt"</span> '(org-roam-dailies-goto-yesterday <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"today"</span>)
    <span style="color: #a6e3a1;">"nrdT"</span> '(org-roam-dailies-goto-tomorrow <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"today"</span>)
    <span style="color: #a6e3a1;">"nrdd"</span> '(org-roam-dailies-goto-date <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"goto date"</span>))
  <span style="color: #f38ba8;">:config</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">org-roam-buffer</span>
  (add-to-list 'display-buffer-alist
               '(<span style="color: #a6e3a1;">"\\*org-roam\\*"</span>
                 (display-buffer-in-direction)
                 (direction . right)
                 (window-width . 0.33)
                 (window-height . fit-window-to-buffer)))
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">get tags to show up in '</span><span style="color: #fab387;">org-roam-node-find</span><span style="color: #505050;">':</span>
  (<span style="color: #cba6f7;">setq</span> org-roam-node-display-template
        (concat <span style="color: #a6e3a1;">"${title:*} "</span>
                (propertize <span style="color: #a6e3a1;">"${tags:10}"</span> 'face 'org-tag)))
  (<span style="color: #cba6f7;">setq</span> org-roam-completion-everywhere t) <span style="color: #6c7086;">;; </span><span style="color: #505050;">roam completion anywhere</span>
  (<span style="color: #cba6f7;">setq</span> org-roam-directory patrl/notes-path)
  (<span style="color: #cba6f7;">setq</span> org-roam-db-location (concat org-roam-directory <span style="color: #a6e3a1;">"/.database/org-roam.db"</span>))
  (org-roam-db-autosync-mode) <span style="color: #6c7086;">;; </span><span style="color: #505050;">ensures that org-roam is available on startup</span>

  <span style="color: #6c7086;">;; </span><span style="color: #505050;">dailies config</span>
  (<span style="color: #cba6f7;">setq</span> org-roam-dailies-directory <span style="color: #a6e3a1;">"daily/"</span>)
  (<span style="color: #cba6f7;">setq</span> org-roam-dailies-capture-templates
        '((<span style="color: #a6e3a1;">"d"</span> <span style="color: #a6e3a1;">"default"</span> entry
           <span style="color: #a6e3a1;">"* %?"</span>
           <span style="color: #f38ba8;">:target</span> (file+head <span style="color: #a6e3a1;">"%&lt;%Y-%m-%d&gt;.org"</span>
                              <span style="color: #a6e3a1;">"#+title: %&lt;%Y-%m-%d&gt;\n#+filetags: daily\n"</span>)))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf363774" class="outline-4">
<h4 id="orgf363774"><span class="section-number-4">8.3.9.</span> Export</h4>
<div class="outline-text-4" id="text-8-3-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">citeproc</span>
  <span style="color: #f38ba8;">:after</span> org)

(<span style="color: #cba6f7;">with-eval-after-load</span> 'ox-latex
   (add-to-list 'org-latex-classes
                '(<span style="color: #a6e3a1;">"scrartcl"</span>
                  <span style="color: #a6e3a1;">"\\documentclass[letterpaper]{scrartcl}"</span>
                  (<span style="color: #a6e3a1;">"\\section{%s}"</span> . <span style="color: #a6e3a1;">"\\section*{%s}"</span>)
                  (<span style="color: #a6e3a1;">"\\subsection{%s}"</span> . <span style="color: #a6e3a1;">"\\subsection*{%s}"</span>)
                  (<span style="color: #a6e3a1;">"\\subsubsection{%s}"</span> . <span style="color: #a6e3a1;">"\\subsubsection*{%s}"</span>)
                  (<span style="color: #a6e3a1;">"\\paragraph{%s}"</span> . <span style="color: #a6e3a1;">"\\paragraph*{%s}"</span>)
                  (<span style="color: #a6e3a1;">"\\subparagraph{%s}"</span> . <span style="color: #a6e3a1;">"\\subparagraph*{%s}"</span>))))

</pre>
</div>
</div>
</div>
<div id="outline-container-org7d7217f" class="outline-4">
<h4 id="org7d7217f"><span class="section-number-4">8.3.10.</span> Highlighting</h4>
<div class="outline-text-4" id="text-8-3-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">htmlize</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org04923e8" class="outline-4">
<h4 id="org04923e8"><span class="section-number-4">8.3.11.</span> Org-noter</h4>
<div class="outline-text-4" id="text-8-3-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">org-noter</span>
  <span style="color: #f38ba8;">:commands</span>
  org-noter
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/local-leader-keys</span>
    <span style="color: #f38ba8;">:keyamps</span> 'org-noter-doc-mode-map
    <span style="color: #a6e3a1;">"i"</span> 'org-noter-insert-note)
  <span style="color: #f38ba8;">:config</span>
  (<span style="color: #cba6f7;">setq</span> org-noter-notes-search-path (list patrl/notes-path))
  (<span style="color: #cba6f7;">setq</span> org-noter-default-notes-file-names '(<span style="color: #a6e3a1;">"literature-notes.org"</span>))
  (<span style="color: #cba6f7;">setq</span> org-noter-hide-other nil)
  (<span style="color: #cba6f7;">setq</span> org-noter-always-create-frame nil))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org57bcab5" class="outline-3">
<h3 id="org57bcab5"><span class="section-number-3">8.4.</span> js</h3>
<div class="outline-text-3" id="text-8-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">js2-mode</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org44506bc" class="outline-3">
<h3 id="org44506bc"><span class="section-number-3">8.5.</span> Rust</h3>
<div class="outline-text-3" id="text-8-5">
<p>
We'll use <code>rust-analyzer</code> by using <code>rustic</code> with eglot.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">rustic</span>
  <span style="color: #f38ba8;">:mode</span> (<span style="color: #a6e3a1;">"\\.rs\\'"</span> . rustic-mode)
  <span style="color: #f38ba8;">:config</span> (<span style="color: #cba6f7;">setq</span> rustic-lsp-client 'eglot))
</pre>
</div>
</div>
</div>
