readme.org
** TODO haskell

- Setup LSP
- Haskell's indentation mode is interacting poorly with tab completion.

  #+begin_src emacs-lisp :tangle init.el
    (use-package haskell-mode)
  #+end_src

~dante~ (which leads on ~ghcid~) can be useful when ~haskell-language-server~ isn't available in the local environment for whatever reason.

Note that the following uses [[*Cape]] to convert dante's company backend to to a capf. 

#+begin_src emacs-lisp :tangle init.el
  (use-package dante
    :after haskell-mode cape
    :init
    (defun dante-setup-capf ()
      (add-to-list 'completion-at-point-functions (cape-company-to-capf #'dante-company)))
    :commands 'dante-mode
    :config (dante-setup-capf))
#+end_src

** racket

#+begin_src emacs-lisp :tangle init.el
  (use-package racket-mode
    :hook (racket-mode . racket-xp-mode) ;; n.b. this requires Dr. Racket to be installed as a backend
    :general
    (patrl/local-leader-keys
      :keymaps 'racket-mode-map
      "r" '(racket-run-and-switch-to-repl :wk "run")
      "e" '(racket-eval-last-sexp :wk "eval last sexp")
      :keymaps 'racket-xp-mode-map
      "xr" '(racket-xp-rename :wk "rename")))
#+end_src
   
** nix

#+begin_src emacs-lisp :tangle init.el 
  (use-package nix-mode
    ;; There's no `nix-mode-map`, so not currently possible to set local bindings.
    :mode "\\.nix\\'")
#+end_src

