docs/index.html
<div id="outline-container-orgc6d8011" class="outline-3">
<h3 id="orgc6d8011"><span class="section-number-3">8.6.</span> <span class="todo TODO">TODO</span> haskell</h3>
<div class="outline-text-3" id="text-8-6">
<ul class="org-ul">
<li>Setup LSP</li>
<li><p>
Haskell's indentation mode is interacting poorly with tab completion.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">haskell-mode</span>)
</pre>
</div></li>
</ul>

<p>
<code>dante</code> (which leads on <code>ghcid</code>) can be useful when <code>haskell-language-server</code> isn't available in the local environment for whatever reason.
</p>

<p>
Note that the following uses <a href="#org2fbafc9">9.5.1</a> to convert dante's company backend to to a capf. 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">dante</span>
  <span style="color: #f38ba8;">:after</span> haskell-mode cape
  <span style="color: #f38ba8;">:init</span>
  (<span style="color: #cba6f7;">defun</span> <span style="color: #89b4fa;">dante-setup-capf</span> ()
    (add-to-list 'completion-at-point-functions (cape-company-to-capf #'dante-company)))
  <span style="color: #f38ba8;">:commands</span> 'dante-mode
  <span style="color: #f38ba8;">:config</span> (dante-setup-capf))
</pre>
</div>
</div>
</div>
<div id="outline-container-org0623335" class="outline-3">
<h3 id="org0623335"><span class="section-number-3">8.7.</span> racket</h3>
<div class="outline-text-3" id="text-8-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">racket-mode</span>
  <span style="color: #f38ba8;">:hook</span> (racket-mode . racket-xp-mode) <span style="color: #6c7086;">;; </span><span style="color: #505050;">n.b. this requires Dr. Racket to be installed as a backend</span>
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/local-leader-keys</span>
    <span style="color: #f38ba8;">:keymaps</span> 'racket-mode-map
    <span style="color: #a6e3a1;">"r"</span> '(racket-run-and-switch-to-repl <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"run"</span>)
    <span style="color: #a6e3a1;">"e"</span> '(racket-eval-last-sexp <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"eval last sexp"</span>)
    <span style="color: #f38ba8;">:keymaps</span> 'racket-xp-mode-map
    <span style="color: #a6e3a1;">"xr"</span> '(racket-xp-rename <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"rename"</span>)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org07be7d8" class="outline-3">
<h3 id="org07be7d8"><span class="section-number-3">8.8.</span> nix</h3>
<div class="outline-text-3" id="text-8-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">nix-mode</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">There's no `nix-mode-map`, so not currently possible to set local bindings.</span>
  <span style="color: #f38ba8;">:mode</span> <span style="color: #a6e3a1;">"\\.nix\\'"</span>)
</pre>
</div>
</div>
</div>
