readme.org
** SOMEDAY latex

Useful resources:

- [[https://github.com/daviwil/emacs-from-scratch/wiki/LaTeX-config-(AucteX)-in-Emacs-from-scratch][LaTeX config (AucteX) in Emacs from scratch · daviwil/emacs-from-scratch Wiki...]]

Configuring ~auctex~ is a little like dealing with a teetering stack of plates.

Bindings:

- ~n b~: insert citation via citar (normal mode).
- ~, p~: preview at point. 
- ~, c~: compile.
  
Auto-activating snippets:

- ~mx~: insert in-line equation.
- ~mq~: insert equation.
- ~ii~: insert itemize environment.
- ~forfor~: insert forest environment.
- ~*i~: insert italicized environment.
- ~*b~: insert bold environment.


#+begin_src emacs-lisp :tangle init.el
  (use-package auctex
    :no-require t
    :mode ("\\.tex\\'" . LaTeX-mode)
    :init
    (setq TeX-parse-self t ; parse on load
	  reftex-plug-into-AUCTeX t
	  TeX-auto-save t  ; parse on save
	  TeX-source-correlate-mode t
	  TeX-source-correlate-method 'synctex
	TeX-source-correlate-start-server nil
	TeX-electric-sub-and-superscript t
	TeX-engine 'luatex ;; use lualatex by default
	TeX-save-query nil))

  (use-package latex
    :straight auctex
    :general
    (patrl/local-leader-keys
      :keymaps 'LaTeX-mode-map
      ;; "TAB" 'TeX-complete-symbol ;; FIXME let's 'TAB' do autocompletion (but it's kind of useless to be honest)
      "=" '(reftex-toc :wk "reftex toc")
      "(" '(reftex-latex :wk "reftex label")
      ")" '(reftex-reference :wk "reftex ref")
      "m" '(LaTeX-macro :wk "insert macro")
      "s" '(LaTeX-section :wk "insert section header")
      "e" '(LaTeX-environment :wk "insert environment")
      "p" '(preview-at-point :wk "preview at point")
      "f" '(TeX-font :wk "font")
      "c" '(TeX-command-run-all :wk "compile"))
    :init
    (setq TeX-electric-math (cons "\\(" "\\)")) ;; '$' inserts an in-line equation '\(...\)'
    ;; (setq preview-scale-function 1.5) ;; too big on vivacia
    :config
    ;; (add-hook 'TeX-mode-hook #'visual-line-mode)
    (add-hook 'TeX-mode-hook #'reftex-mode)
    (add-hook 'TeX-mode-hook #'olivetti-mode)
    (add-hook 'TeX-mode-hook #'turn-on-auto-fill)
    (add-hook 'TeX-mode-hook #'prettify-symbols-mode)
    (add-hook 'TeX-after-compilation-finished-functions
		#'TeX-revert-document-buffer)
    (add-to-list 'TeX-view-program-selection '(output-pdf "PDF Tools"))
    (add-hook 'TeX-mode-hook #'outline-minor-mode))
    ;; (add-hook 'TeX-mode-hook #'flymake-aspell-setup)
    ;; (add-to-list 'TeX-view-program-selection '(output-pdf "Zathura")))
#+end_src

~evil-tex~ is a crucial component in my workflow. ~evil-surround~ integration makes things a breeze. Some examples:

- Italicize word from point in normal mode: ~ysw;i~.

#+begin_src emacs-lisp :tangle init.el
  (use-package evil-tex
    :hook (LaTeX-mode . evil-tex-mode))
#+end_src

#+begin_src emacs-lisp :tangle init.el
  (use-package citar
    :after all-the-icons
    :init
    (defun citar-setup-capf ()
      (add-to-list 'completion-at-point-functions 'citar-capf))
    :hook
    (LaTeX-mode . citar-setup-capf)
    (org-mode . citar-setup-capf)
    :config
    ;; icon support via all-the-icons
    (setq citar-symbols
          `((file ,(all-the-icons-faicon "file-o" :face 'all-the-icons-green :v-adjust -0.1) . " ")
            (note ,(all-the-icons-material "speaker_notes" :face 'all-the-icons-blue :v-adjust -0.3) . " ")
            (link ,(all-the-icons-octicon "link" :face 'all-the-icons-orange :v-adjust 0.01) . " ")))
    (setq citar-symbol-separator "  ")
    :general
    (patrl/leader-keys
      "nb" '(citar-open :wk "citar"))
    :init
    (setq citar-notes-paths (list patrl/notes-path))
    (setq citar-library-paths (list patrl/library-path))
    (setq citar-bibliography (list patrl/global-bib-file)))
#+end_src

#+begin_src emacs-lisp :tangle init.el
  (use-package citar-embark
    :after citar embark
    :config (citar-embark-mode))
#+end_src

**** TODO add "citep" and "citealt" to the supported list of latex citation commands.

**** Engrave

Uses emacs' font lock to highlight source code blocks in latex.

#+begin_src emacs-lisp :tangle init.el
  (use-package engrave-faces)
#+end_src

**** TODO latexmk

#+begin_src emacs-lisp :tangle init.el
  ;; FIXME
  (use-package auctex-latexmk
    :disabled
    :after latex 
    :init
    (setq auctex-latexmk-inherit-TeX-PDF-mode t)
    :config
    (auctex-latexmk-setup))
#+end_src

*** Issues
**** TODO pdf buffer isn't reverted in preview continuously mode.
I think probably I just need to use zathura as the pdf viewer, which has its own smart revert functionality.

