docs/index.html
<div id="outline-container-orgc7a24f4" class="outline-3">
<h3 id="orgc7a24f4"><span class="section-number-3">8.9.</span> <span class="todo SOMEDAY">SOMEDAY</span> latex</h3>
<div class="outline-text-3" id="text-8-9">
<p>
Useful resources:
</p>

<ul class="org-ul">
<li><a href="https://github.com/daviwil/emacs-from-scratch/wiki/LaTeX-config-(AucteX)-in-Emacs-from-scratch">LaTeX config (AucteX) in Emacs from scratch · daviwil/emacs-from-scratch Wiki&#x2026;</a></li>
</ul>

<p>
Configuring <code>auctex</code> is a little like dealing with a teetering stack of plates.
</p>

<p>
Bindings:
</p>

<ul class="org-ul">
<li><code>n b</code>: insert citation via citar (normal mode).</li>
<li><code>, p</code>: preview at point.</li>
<li><code>, c</code>: compile.</li>
</ul>

<p>
Auto-activating snippets:
</p>

<ul class="org-ul">
<li><code>mx</code>: insert in-line equation.</li>
<li><code>mq</code>: insert equation.</li>
<li><code>ii</code>: insert itemize environment.</li>
<li><code>forfor</code>: insert forest environment.</li>
<li><code>*i</code>: insert italicized environment.</li>
<li><code>*b</code>: insert bold environment.</li>
</ul>


<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">auctex</span>
  <span style="color: #f38ba8;">:no-require</span> t
  <span style="color: #f38ba8;">:mode</span> (<span style="color: #a6e3a1;">"\\.tex\\'"</span> . LaTeX-mode)
  <span style="color: #f38ba8;">:init</span>
  (<span style="color: #cba6f7;">setq</span> TeX-parse-self t <span style="color: #6c7086;">; </span><span style="color: #505050;">parse on load</span>
          reftex-plug-into-AUCTeX t
          TeX-auto-save t  <span style="color: #6c7086;">; </span><span style="color: #505050;">parse on save</span>
          TeX-source-correlate-mode t
          TeX-source-correlate-method 'synctex
        TeX-source-correlate-start-server nil
        TeX-electric-sub-and-superscript t
        TeX-engine 'luatex <span style="color: #6c7086;">;; </span><span style="color: #505050;">use lualatex by default</span>
        TeX-save-query nil))

(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">latex</span>
  <span style="color: #f38ba8;">:straight</span> auctex
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/local-leader-keys</span>
    <span style="color: #f38ba8;">:keymaps</span> 'LaTeX-mode-map
    <span style="color: #6c7086;">;; </span><span style="color: #505050;">"TAB" 'TeX-complete-symbol ;; </span><span style="color: #a0132f; font-weight: bold;">FIXME</span><span style="color: #505050;"> let's '</span><span style="color: #fab387;">TAB</span><span style="color: #505050;">' do autocompletion (but it's kind of useless to be honest)</span>
    <span style="color: #a6e3a1;">"="</span> '(reftex-toc <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"reftex toc"</span>)
    <span style="color: #a6e3a1;">"("</span> '(reftex-latex <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"reftex label"</span>)
    <span style="color: #a6e3a1;">")"</span> '(reftex-reference <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"reftex ref"</span>)
    <span style="color: #a6e3a1;">"m"</span> '(LaTeX-macro <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"insert macro"</span>)
    <span style="color: #a6e3a1;">"s"</span> '(LaTeX-section <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"insert section header"</span>)
    <span style="color: #a6e3a1;">"e"</span> '(LaTeX-environment <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"insert environment"</span>)
    <span style="color: #a6e3a1;">"p"</span> '(preview-at-point <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"preview at point"</span>)
    <span style="color: #a6e3a1;">"f"</span> '(TeX-font <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"font"</span>)
    <span style="color: #a6e3a1;">"c"</span> '(TeX-command-run-all <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"compile"</span>))
  <span style="color: #f38ba8;">:init</span>
  (<span style="color: #cba6f7;">setq</span> TeX-electric-math (cons <span style="color: #a6e3a1;">"</span><span style="color: #ff00ff;">\\</span><span style="color: #ff00ff;">(</span><span style="color: #a6e3a1;">"</span> <span style="color: #a6e3a1;">"</span><span style="color: #ff00ff;">\\</span><span style="color: #ff00ff;">)</span><span style="color: #a6e3a1;">"</span>)) <span style="color: #6c7086;">;; </span><span style="color: #505050;">'</span><span style="color: #fab387;">$</span><span style="color: #505050;">' inserts an in-line equation '</span><span style="color: #fab387;">\(...\)</span><span style="color: #505050;">'</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">(setq preview-scale-function 1.5) ;; too big on vivacia</span>
  <span style="color: #f38ba8;">:config</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">(add-hook 'TeX-mode-hook #'visual-line-mode)</span>
  (add-hook 'TeX-mode-hook #'reftex-mode)
  (add-hook 'TeX-mode-hook #'olivetti-mode)
  (add-hook 'TeX-mode-hook #'turn-on-auto-fill)
  (add-hook 'TeX-mode-hook #'prettify-symbols-mode)
  (add-hook 'TeX-after-compilation-finished-functions
                #'TeX-revert-document-buffer)
  (add-to-list 'TeX-view-program-selection '(output-pdf <span style="color: #a6e3a1;">"PDF Tools"</span>))
  (add-hook 'TeX-mode-hook #'outline-minor-mode))
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">(add-hook 'TeX-mode-hook #'flymake-aspell-setup)</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">(add-to-list 'TeX-view-program-selection '(output-pdf "Zathura")))</span>
</pre>
</div>

<p>
<code>evil-tex</code> is a crucial component in my workflow. <code>evil-surround</code> integration makes things a breeze. Some examples:
</p>

<ul class="org-ul">
<li>Italicize word from point in normal mode: <code>ysw;i</code>.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">evil-tex</span>
  <span style="color: #f38ba8;">:hook</span> (LaTeX-mode . evil-tex-mode))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">citar</span>
  <span style="color: #f38ba8;">:after</span> all-the-icons
  <span style="color: #f38ba8;">:init</span>
  (<span style="color: #cba6f7;">defun</span> <span style="color: #89b4fa;">citar-setup-capf</span> ()
    (add-to-list 'completion-at-point-functions 'citar-capf))
  <span style="color: #f38ba8;">:hook</span>
  (LaTeX-mode . citar-setup-capf)
  (org-mode . citar-setup-capf)
  <span style="color: #f38ba8;">:config</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">icon support via all-the-icons</span>
  (<span style="color: #cba6f7;">setq</span> citar-symbols
        `((file ,(all-the-icons-faicon <span style="color: #a6e3a1;">"file-o"</span> <span style="color: #f38ba8;">:face</span> 'all-the-icons-green <span style="color: #f38ba8;">:v-adjust</span> -0.1) . <span style="color: #a6e3a1;">" "</span>)
          (note ,(all-the-icons-material <span style="color: #a6e3a1;">"speaker_notes"</span> <span style="color: #f38ba8;">:face</span> 'all-the-icons-blue <span style="color: #f38ba8;">:v-adjust</span> -0.3) . <span style="color: #a6e3a1;">" "</span>)
          (link ,(all-the-icons-octicon <span style="color: #a6e3a1;">"link"</span> <span style="color: #f38ba8;">:face</span> 'all-the-icons-orange <span style="color: #f38ba8;">:v-adjust</span> 0.01) . <span style="color: #a6e3a1;">" "</span>)))
  (<span style="color: #cba6f7;">setq</span> citar-symbol-separator <span style="color: #a6e3a1;">"  "</span>)
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"nb"</span> '(citar-open <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"citar"</span>))
  <span style="color: #f38ba8;">:init</span>
  (<span style="color: #cba6f7;">setq</span> citar-notes-paths (list patrl/notes-path))
  (<span style="color: #cba6f7;">setq</span> citar-library-paths (list patrl/library-path))
  (<span style="color: #cba6f7;">setq</span> citar-bibliography (list patrl/global-bib-file)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">citar-embark</span>
  <span style="color: #f38ba8;">:after</span> citar embark
  <span style="color: #f38ba8;">:config</span> (citar-embark-mode))
</pre>
</div>
</div>
<ol class="org-ol">
<li><a id="org257c716"></a><span class="todo TODO">TODO</span> add "citep" and "citealt" to the supported list of latex citation commands.<br /></li>

<li><a id="org2247347"></a>Engrave<br />
<div class="outline-text-5" id="text-8-9-0-2">
<p>
Uses emacs' font lock to highlight source code blocks in latex.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">engrave-faces</span>)
</pre>
</div>
</div>
</li>
<li><a id="org206539a"></a><span class="todo TODO">TODO</span> latexmk<br />
<div class="outline-text-5" id="text-8-9-0-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #6c7086;">;; </span><span style="color: #a0132f; font-weight: bold;">FIXME</span>
(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">auctex-latexmk</span>
  <span style="color: #f38ba8;">:disabled</span>
  <span style="color: #f38ba8;">:after</span> latex 
  <span style="color: #f38ba8;">:init</span>
  (<span style="color: #cba6f7;">setq</span> auctex-latexmk-inherit-TeX-PDF-mode t)
  <span style="color: #f38ba8;">:config</span>
  (auctex-latexmk-setup))
</pre>
</div>
</div>
</li>
</ol>
<div id="outline-container-orgad22320" class="outline-4">
<h4 id="orgad22320"><span class="section-number-4">8.9.1.</span> Issues</h4>
<div class="outline-text-4" id="text-8-9-1">
</div>
<ol class="org-ol">
<li><a id="orgc9da5a2"></a><span class="todo TODO">TODO</span> pdf buffer isn't reverted in preview continuously mode.<br />
<div class="outline-text-5" id="text-8-9-1-1">
<p>
I think probably I just need to use zathura as the pdf viewer, which has its own smart revert functionality.
</p>
</div>
</li>
</ol>
</div>
</div>
