readme.org
** markdown  

#+begin_src emacs-lisp :tangle init.el
  (use-package markdown-mode
    :hook ((markdown-mode . visual-line-mode)
           (markdown-mode . olivetti-mode))
           (markdown-mode . variable-pitch-mode)
    :commands (markdown-mode gfm-mode)
    :mode (("README\\.md\\'" . gfm-mode)
           ("\\.md\\'" . markdown-mode)
           ("\\.markdown\\'" . markdown-mode))
    :init
    (setq markdown-command "pandoc")
    (setq markdown-header-scaling t))
#+end_src
   
#+begin_src emacs-lisp :tangle init.el 
  (use-package pandoc-mode
    :after markdown-mode
    :hook (markdown-mode . pandoc-mode))
#+end_src

* Completion

** Vertico with orderless and marginalia

#+begin_src emacs-lisp :tangle init.el
  (use-package vertico
    :init (vertico-mode)
    (setq vertico-cycle t) ;; enable cycling for 'vertico-next' and 'vertico-prev'
    :general
    (:keymaps 'vertico-map
              ;; keybindings to cycle through vertico results.
              "C-j" 'vertico-next
              "C-k" 'vertico-previous
              "C-f" 'vertico-exit)
    (:keymaps 'minibuffer-local-map
              "M-h" 'backward-kill-word))

  (use-package orderless
    :init
    (setq completion-styles '(orderless)
          completion-category-defaults nil
          completion-category-overrides '((file (styles partial-completion)))))

  (use-package savehist
    :init
    (savehist-mode))

  (use-package marginalia
    :after vertico
    :custom
    (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
    :init
    (marginalia-mode))
#+end_src

** Consult 

#+begin_src emacs-lisp :tangle init.el
  (use-package consult
    :general
    (patrl/leader-keys
      "bb" '(consult-buffer :wk "consult buffer")
      "Bb" '(consult-bookmark :wk "consult bookmark")
      "ht" '(consult-theme :wk "consult theme")
      "sr" '(consult-ripgrep :wk "consult rg")
      "sg" '(consult-grep :wk "consult grep")
      "sG" '(consult-git-grep :wk "consult git grep")
      "sf" '(consult-find :wk "consult find")
      "sF" '(consult-locate :wk "consult locate")
      "sl" '(consult-line :wk "consult line")
      "sy" '(consult-yank-from-kill-ring :wk "consult yank from kill ring")
      "i" '(consult-imenu :wk "consult imenu"))
    :config
    ;; use project.el to retrieve the project root
    (setq consult-project-root-function
          (lambda ()
            (when-let (project (project-current))
              (car (project-roots project))))))
#+end_src

** Affe

#+begin_src emacs-lisp :tangle init.el
  (use-package affe
    :after orderless
    :general
    (patrl/leader-keys
      "sa" '(affe-grep :wk "affe grep")
      "sw" '(affe-find :wk "affe find"))
    :init
    (defun affe-orderless-regexp-compiler (input _type _ignorecase)
      (setq input (orderless-pattern-compiler input))
      (cons input (lambda (str) (orderless--highlight input str))))
    :config
    (setq affe-regexp-compiler #'affe-orderless-regexp-compiler))
#+end_src

** Embark

#+begin_src emacs-lisp :tangle init.el
  (use-package embark
    :general
    (patrl/leader-keys
       "." 'embark-act) ;; easily accessible 'embark-act' binding.
    ("C-;" 'embark-dwim)
    (:keymaps 'vertico-map
              "C-." 'embark-act)
    (:keymaps 'embark-heading-map
              "l" 'org-id-store-link)
    :init
    (setq prefix-help-command #'embark-prefix-help-command))

  (use-package embark-consult
    :after (embark consult)
    :demand t ; only necessary if you have the hook below
    ;; if you want to have consult previews as you move around an
    ;; auto-updating embark collect buffer
    :hook
    (embark-collect-mode . consult-preview-at-point-mode))
#+end_src

** Corfu

A minimal ui for ~completion-in-region~.

#+begin_src emacs-lisp :tangle init.el 
  (use-package corfu
    :hook
    (eval-expression-minibuffer-setup . corfu-mode)
    :init
    (global-corfu-mode) 
    :custom
    (corfu-cycle t) ;; allows cycling through candidates
    (corfu-auto nil) ;; disables auto-completion
    :bind
    :general
    (:keymaps 'corfu-map
              "SPC" 'corfu-insert-separator)) ;; for compatibility with orderless

  (general-unbind
    :states '(insert)
    "C-k") ;; this was interfering with corfu completion

  (use-package emacs
    :init
    (setq tab-always-indent 'complete)) ;; enable tab completion
#+end_src

