docs/index.html
<div id="outline-container-orgcadbe99" class="outline-3">
<h3 id="orgcadbe99"><span class="section-number-3">8.10.</span> markdown</h3>
<div class="outline-text-3" id="text-8-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">markdown-mode</span>
  <span style="color: #f38ba8;">:hook</span> ((markdown-mode . visual-line-mode)
         (markdown-mode . olivetti-mode))
         (markdown-mode . variable-pitch-mode)
  <span style="color: #f38ba8;">:commands</span> (markdown-mode gfm-mode)
  <span style="color: #f38ba8;">:mode</span> ((<span style="color: #a6e3a1;">"README\\.md\\'"</span> . gfm-mode)
         (<span style="color: #a6e3a1;">"\\.md\\'"</span> . markdown-mode)
         (<span style="color: #a6e3a1;">"\\.markdown\\'"</span> . markdown-mode))
  <span style="color: #f38ba8;">:init</span>
  (<span style="color: #cba6f7;">setq</span> markdown-command <span style="color: #a6e3a1;">"pandoc"</span>)
  (<span style="color: #cba6f7;">setq</span> markdown-header-scaling t))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">pandoc-mode</span>
  <span style="color: #f38ba8;">:after</span> markdown-mode
  <span style="color: #f38ba8;">:hook</span> (markdown-mode . pandoc-mode))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge8640dc" class="outline-2">
<h2 id="orge8640dc"><span class="section-number-2">9.</span> Completion</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgb4ca9b8" class="outline-3">
<h3 id="orgb4ca9b8"><span class="section-number-3">9.1.</span> Vertico with orderless and marginalia</h3>
<div class="outline-text-3" id="text-9-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">vertico</span>
  <span style="color: #f38ba8;">:init</span> (vertico-mode)
  (<span style="color: #cba6f7;">setq</span> vertico-cycle t) <span style="color: #6c7086;">;; </span><span style="color: #505050;">enable cycling for '</span><span style="color: #fab387;">vertico-next</span><span style="color: #505050;">' and '</span><span style="color: #fab387;">vertico-prev</span><span style="color: #505050;">'</span>
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #f38ba8;">:keymaps</span> 'vertico-map
            <span style="color: #6c7086;">;; </span><span style="color: #505050;">keybindings to cycle through vertico results.</span>
            <span style="color: #a6e3a1;">"C-j"</span> 'vertico-next
            <span style="color: #a6e3a1;">"C-k"</span> 'vertico-previous
            <span style="color: #a6e3a1;">"C-f"</span> 'vertico-exit)
  (<span style="color: #f38ba8;">:keymaps</span> 'minibuffer-local-map
            <span style="color: #a6e3a1;">"M-h"</span> 'backward-kill-word))

(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">orderless</span>
  <span style="color: #f38ba8;">:init</span>
  (<span style="color: #cba6f7;">setq</span> completion-styles '(orderless)
        completion-category-defaults nil
        completion-category-overrides '((file (styles partial-completion)))))

(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">savehist</span>
  <span style="color: #f38ba8;">:init</span>
  (savehist-mode))

(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">marginalia</span>
  <span style="color: #f38ba8;">:after</span> vertico
  <span style="color: #f38ba8;">:custom</span>
  (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
  <span style="color: #f38ba8;">:init</span>
  (marginalia-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb1add5b" class="outline-3">
<h3 id="orgb1add5b"><span class="section-number-3">9.2.</span> Consult</h3>
<div class="outline-text-3" id="text-9-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">consult</span>
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"bb"</span> '(consult-buffer <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"consult buffer"</span>)
    <span style="color: #a6e3a1;">"Bb"</span> '(consult-bookmark <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"consult bookmark"</span>)
    <span style="color: #a6e3a1;">"ht"</span> '(consult-theme <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"consult theme"</span>)
    <span style="color: #a6e3a1;">"sr"</span> '(consult-ripgrep <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"consult rg"</span>)
    <span style="color: #a6e3a1;">"sg"</span> '(consult-grep <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"consult grep"</span>)
    <span style="color: #a6e3a1;">"sG"</span> '(consult-git-grep <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"consult git grep"</span>)
    <span style="color: #a6e3a1;">"sf"</span> '(consult-find <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"consult find"</span>)
    <span style="color: #a6e3a1;">"sF"</span> '(consult-locate <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"consult locate"</span>)
    <span style="color: #a6e3a1;">"sl"</span> '(consult-line <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"consult line"</span>)
    <span style="color: #a6e3a1;">"sy"</span> '(consult-yank-from-kill-ring <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"consult yank from kill ring"</span>)
    <span style="color: #a6e3a1;">"i"</span> '(consult-imenu <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"consult imenu"</span>))
  <span style="color: #f38ba8;">:config</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">use project.el to retrieve the project root</span>
  (<span style="color: #cba6f7;">setq</span> consult-project-root-function
        (<span style="color: #cba6f7;">lambda</span> ()
          (<span style="color: #cba6f7;">when-let</span> (project (project-current))
            (car (project-roots project))))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org8bfdee7" class="outline-3">
<h3 id="org8bfdee7"><span class="section-number-3">9.3.</span> Affe</h3>
<div class="outline-text-3" id="text-9-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">affe</span>
  <span style="color: #f38ba8;">:after</span> orderless
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"sa"</span> '(affe-grep <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"affe grep"</span>)
    <span style="color: #a6e3a1;">"sw"</span> '(affe-find <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"affe find"</span>))
  <span style="color: #f38ba8;">:init</span>
  (<span style="color: #cba6f7;">defun</span> <span style="color: #89b4fa;">affe-orderless-regexp-compiler</span> (input _type _ignorecase)
    (<span style="color: #cba6f7;">setq</span> input (orderless-pattern-compiler input))
    (cons input (<span style="color: #cba6f7;">lambda</span> (str) (orderless--highlight input str))))
  <span style="color: #f38ba8;">:config</span>
  (<span style="color: #cba6f7;">setq</span> affe-regexp-compiler #'affe-orderless-regexp-compiler))
</pre>
</div>
</div>
</div>
<div id="outline-container-org57a61b5" class="outline-3">
<h3 id="org57a61b5"><span class="section-number-3">9.4.</span> Embark</h3>
<div class="outline-text-3" id="text-9-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">embark</span>
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
     <span style="color: #a6e3a1;">"."</span> 'embark-act) <span style="color: #6c7086;">;; </span><span style="color: #505050;">easily accessible '</span><span style="color: #fab387;">embark-act</span><span style="color: #505050;">' binding.</span>
  (<span style="color: #a6e3a1;">"C-;"</span> 'embark-dwim)
  (<span style="color: #f38ba8;">:keymaps</span> 'vertico-map
            <span style="color: #a6e3a1;">"C-."</span> 'embark-act)
  (<span style="color: #f38ba8;">:keymaps</span> 'embark-heading-map
            <span style="color: #a6e3a1;">"l"</span> 'org-id-store-link)
  <span style="color: #f38ba8;">:init</span>
  (<span style="color: #cba6f7;">setq</span> prefix-help-command #'embark-prefix-help-command))

(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">embark-consult</span>
  <span style="color: #f38ba8;">:after</span> (embark consult)
  <span style="color: #f38ba8;">:demand</span> t <span style="color: #6c7086;">; </span><span style="color: #505050;">only necessary if you have the hook below</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">if you want to have consult previews as you move around an</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">auto-updating embark collect buffer</span>
  <span style="color: #f38ba8;">:hook</span>
  (embark-collect-mode . consult-preview-at-point-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org9a0bf09" class="outline-3">
<h3 id="org9a0bf09"><span class="section-number-3">9.5.</span> Corfu</h3>
<div class="outline-text-3" id="text-9-5">
<p>
A minimal ui for <code>completion-in-region</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">corfu</span>
  <span style="color: #f38ba8;">:hook</span>
  (eval-expression-minibuffer-setup . corfu-mode)
  <span style="color: #f38ba8;">:init</span>
  (global-corfu-mode) 
  <span style="color: #f38ba8;">:custom</span>
  (corfu-cycle t) <span style="color: #6c7086;">;; </span><span style="color: #505050;">allows cycling through candidates</span>
  (corfu-auto nil) <span style="color: #6c7086;">;; </span><span style="color: #505050;">disables auto-completion</span>
  <span style="color: #f38ba8;">:bind</span>
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #f38ba8;">:keymaps</span> 'corfu-map
            <span style="color: #a6e3a1;">"SPC"</span> 'corfu-insert-separator)) <span style="color: #6c7086;">;; </span><span style="color: #505050;">for compatibility with orderless</span>

(<span style="color: #cba6f7;">general-unbind</span>
  <span style="color: #f38ba8;">:states</span> '(insert)
  <span style="color: #a6e3a1;">"C-k"</span>) <span style="color: #6c7086;">;; </span><span style="color: #505050;">this was interfering with corfu completion</span>

(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">emacs</span>
  <span style="color: #f38ba8;">:init</span>
  (<span style="color: #cba6f7;">setq</span> tab-always-indent 'complete)) <span style="color: #6c7086;">;; </span><span style="color: #505050;">enable tab completion</span>
</pre>
</div>
</div>
