readme.org
*** Cape

- [[https://kristofferbalintona.me/posts/202203130102/][Cape | Kristoffer Balintona]]
  
#+begin_src emacs-lisp :tangle init.el
  (use-package cape
    ;; bindings for dedicated completion commands
    :general
    ("M-p p" 'completion-at-point ;; capf
     "M-p t" 'complete-tag ;; etags
     "M-p d" 'cape-dabbrev ;; dabbrev
     "M-p h" 'cape-history
     "M-p f" 'cape-file
     "M-p k" 'cape-keyword
     "M-p s" 'cape-symbol
     "M-p a" 'cape-abbrev
     "M-p i" 'cape-ispell
     "M-p l" 'cape-line
     "M-p w" 'cape-dict
     "M-p \\" 'cape-tex
     "M-p &" 'cape-sgml
     "M-p r" 'cape-rfc1345)
    :init
    (add-to-list 'completion-at-point-functions #'cape-file)
    (add-to-list 'completion-at-point-functions #'cape-dabbrev))
#+end_src

Convert the ~company-reftex-labels~ backend to a capf using ~cape~ and activate in in ~LaTeX-mode~:

#+begin_src emacs-lisp :tangle init.el
  (use-package company-reftex
    :after cape
    :init
    (defun reftex-setup-capf ()
      (add-to-list 'completion-at-point-functions (cape-company-to-capf #'company-reftex-labels)))
    :hook
    (LaTeX-mode . reftex-setup-capf))
#+end_src

* Checkers

- Use ~flymake~ over ~flycheck~.

** Flymake

#+begin_src emacs-lisp :tangle init.el
  (use-package flymake
    :straight (:type built-in)
    :general
    (patrl/leader-keys
      :keymaps 'flymake-mode-map
      "cf" '(consult-flymake :wk "consult flymake") ;; depends on consult
      "cc" '(flymake-mode :wk "toggle flymake")) ;; depends on consult
    :hook
    (TeX-mode . flymake-mode) ;; this is now working
    (emacs-lisp-mode . flymake-mode)
    :custom
    (flymake-no-changes-timeout nil)
    :general
    (general-nmap "] !" 'flymake-goto-next-error)
    (general-nmap "[ !" 'flymake-goto-prev-error))
#+end_src
   
* Tools   

IMPORTANT: because this uses natively-compiled code, I install this alongside emacs via nix. 

#+begin_src emacs-lisp :tangle init.el
    (use-package pdf-tools
      :straight (:type built-in)
      :mode ("\\.pdf\\'" . pdf-view-mode)
    )
#+end_src

** Jinx

IMPORTANT: because this uses natively-compiled code, I install this alongside emacs via nix, rather than in the usual way (hence the ~build-in~ straight keyword).

#+begin_src emacs-lisp :tangle init.el
  (use-package jinx
    :straight (:type built-in)
    :hook (emacs-startup . global-jinx-mode))
#+end_src

** Helpful

#+begin_src emacs-lisp :tangle init.el
  (use-package helpful
    :general
    (patrl/leader-keys
      "hc" '(helpful-command :wk "helpful command")
      "hf" '(helpful-callable :wk "helpful callable")
      "hh" '(helpful-at-point :wk "helpful at point")
      "hF" '(helpful-function :wk "helpful function")
      "hv" '(helpful-variable :wk "helpful variable")
      "hk" '(helpful-key :wk "helpful key")))
#+end_src

** Deadgrep

The best search package.

#+begin_src emacs-lisp :tangle init.el
  (use-package deadgrep
    :general
    (patrl/leader-keys
      "sd" '(deadgrep :wk "deadgrep")))
#+end_src

** Snippets

