docs/index.html
<div id="outline-container-org2fbafc9" class="outline-4">
<h4 id="org2fbafc9"><span class="section-number-4">9.5.1.</span> Cape</h4>
<div class="outline-text-4" id="text-9-5-1">
<ul class="org-ul">
<li><a href="https://kristofferbalintona.me/posts/202203130102/">Cape | Kristoffer Balintona</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">cape</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">bindings for dedicated completion commands</span>
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #a6e3a1;">"M-p p"</span> 'completion-at-point <span style="color: #6c7086;">;; </span><span style="color: #505050;">capf</span>
   <span style="color: #a6e3a1;">"M-p t"</span> 'complete-tag <span style="color: #6c7086;">;; </span><span style="color: #505050;">etags</span>
   <span style="color: #a6e3a1;">"M-p d"</span> 'cape-dabbrev <span style="color: #6c7086;">;; </span><span style="color: #505050;">dabbrev</span>
   <span style="color: #a6e3a1;">"M-p h"</span> 'cape-history
   <span style="color: #a6e3a1;">"M-p f"</span> 'cape-file
   <span style="color: #a6e3a1;">"M-p k"</span> 'cape-keyword
   <span style="color: #a6e3a1;">"M-p s"</span> 'cape-symbol
   <span style="color: #a6e3a1;">"M-p a"</span> 'cape-abbrev
   <span style="color: #a6e3a1;">"M-p i"</span> 'cape-ispell
   <span style="color: #a6e3a1;">"M-p l"</span> 'cape-line
   <span style="color: #a6e3a1;">"M-p w"</span> 'cape-dict
   <span style="color: #a6e3a1;">"M-p \\"</span> 'cape-tex
   <span style="color: #a6e3a1;">"M-p &amp;"</span> 'cape-sgml
   <span style="color: #a6e3a1;">"M-p r"</span> 'cape-rfc1345)
  <span style="color: #f38ba8;">:init</span>
  (add-to-list 'completion-at-point-functions #'cape-file)
  (add-to-list 'completion-at-point-functions #'cape-dabbrev))
</pre>
</div>

<p>
Convert the <code>company-reftex-labels</code> backend to a capf using <code>cape</code> and activate in in <code>LaTeX-mode</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">company-reftex</span>
  <span style="color: #f38ba8;">:after</span> cape
  <span style="color: #f38ba8;">:init</span>
  (<span style="color: #cba6f7;">defun</span> <span style="color: #89b4fa;">reftex-setup-capf</span> ()
    (add-to-list 'completion-at-point-functions (cape-company-to-capf #'company-reftex-labels)))
  <span style="color: #f38ba8;">:hook</span>
  (LaTeX-mode . reftex-setup-capf))
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org4ad97f2" class="outline-2">
<h2 id="org4ad97f2"><span class="section-number-2">10.</span> Checkers</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>Use <code>flymake</code> over <code>flycheck</code>.</li>
</ul>
</div>
<div id="outline-container-org9816c0c" class="outline-3">
<h3 id="org9816c0c"><span class="section-number-3">10.1.</span> Flymake</h3>
<div class="outline-text-3" id="text-10-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">flymake</span>
  <span style="color: #f38ba8;">:straight</span> (<span style="color: #f38ba8;">:type</span> built-in)
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #f38ba8;">:keymaps</span> 'flymake-mode-map
    <span style="color: #a6e3a1;">"cf"</span> '(consult-flymake <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"consult flymake"</span>) <span style="color: #6c7086;">;; </span><span style="color: #505050;">depends on consult</span>
    <span style="color: #a6e3a1;">"cc"</span> '(flymake-mode <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"toggle flymake"</span>)) <span style="color: #6c7086;">;; </span><span style="color: #505050;">depends on consult</span>
  <span style="color: #f38ba8;">:hook</span>
  (TeX-mode . flymake-mode) <span style="color: #6c7086;">;; </span><span style="color: #505050;">this is now working</span>
  (emacs-lisp-mode . flymake-mode)
  <span style="color: #f38ba8;">:custom</span>
  (flymake-no-changes-timeout nil)
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">general-nmap</span> <span style="color: #a6e3a1;">"] !"</span> 'flymake-goto-next-error)
  (<span style="color: #cba6f7;">general-nmap</span> <span style="color: #a6e3a1;">"[ !"</span> 'flymake-goto-prev-error))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org9c64672" class="outline-2">
<h2 id="org9c64672"><span class="section-number-2">11.</span> Tools</h2>
<div class="outline-text-2" id="text-11">
<p>
IMPORTANT: because this uses natively-compiled code, I install this alongside emacs via nix. 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">pdf-tools</span>
  <span style="color: #f38ba8;">:straight</span> (<span style="color: #f38ba8;">:type</span> built-in)
  <span style="color: #f38ba8;">:mode</span> (<span style="color: #a6e3a1;">"\\.pdf\\'"</span> . pdf-view-mode)
)
</pre>
</div>
</div>
<div id="outline-container-org91bc335" class="outline-3">
<h3 id="org91bc335"><span class="section-number-3">11.1.</span> Jinx</h3>
<div class="outline-text-3" id="text-11-1">
<p>
IMPORTANT: because this uses natively-compiled code, I install this alongside emacs via nix, rather than in the usual way (hence the <code>build-in</code> straight keyword).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">jinx</span>
  <span style="color: #f38ba8;">:straight</span> (<span style="color: #f38ba8;">:type</span> built-in)
  <span style="color: #f38ba8;">:hook</span> (emacs-startup . global-jinx-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org3fc3b08" class="outline-3">
<h3 id="org3fc3b08"><span class="section-number-3">11.2.</span> Helpful</h3>
<div class="outline-text-3" id="text-11-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">helpful</span>
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"hc"</span> '(helpful-command <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"helpful command"</span>)
    <span style="color: #a6e3a1;">"hf"</span> '(helpful-callable <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"helpful callable"</span>)
    <span style="color: #a6e3a1;">"hh"</span> '(helpful-at-point <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"helpful at point"</span>)
    <span style="color: #a6e3a1;">"hF"</span> '(helpful-function <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"helpful function"</span>)
    <span style="color: #a6e3a1;">"hv"</span> '(helpful-variable <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"helpful variable"</span>)
    <span style="color: #a6e3a1;">"hk"</span> '(helpful-key <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"helpful key"</span>)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org8ac5ad7" class="outline-3">
<h3 id="org8ac5ad7"><span class="section-number-3">11.3.</span> Deadgrep</h3>
<div class="outline-text-3" id="text-11-3">
<p>
The best search package.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">deadgrep</span>
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"sd"</span> '(deadgrep <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"deadgrep"</span>)))
</pre>
</div>
</div>
</div>
