readme.org
*** Auto-activating snippets

#+begin_src emacs-lisp :tangle init.el
  (use-package aas
    :hook (LaTeX-mode . aas-activate-for-major-mode)
    :hook (org-mode . aas-activate-for-major-mode)
    :config
    ;; easy emoji entry in text mode.
    (aas-set-snippets 'text-mode
      ":-)" "🙂"
      "8-)" "😎"
      ":rofl" "🤣"
      ":lol" "😂"
      "<3" "❤️"
      ":eyes" "👀"
      ":dragon" "🐉"
      ":fire" "🔥"
      ":hole" "🕳️"
      ":flush" "😳"
      ":wow" "😮"))
#+end_src

Not sure if laas mode is properly activating in latex mode. 

#+begin_src emacs-lisp :tangle init.el
  (use-package laas
    ;; disables accent snippets - things like 'l (which expands to \textsl{}) end up being very disruptive in practice.
    :init (setq laas-accent-snippets nil)
    :hook ((LaTeX-mode . laas-mode)
	   (org-mode . laas-mode))
    :config
    (aas-set-snippets 'laas-mode
      ;; I need to make sure not to accidentally trigger the following, so I should only use impossible (or extremely rare) bigrams/trigrams.
      ;; "*b" (lambda () (interactive)
      ;;        (yas-expand-snippet "\\textbf{$1}$0"))
      ;; "*i" (lambda () (interactive)
      ;; 	   (yas-expand-snippet "\\textit{$1}$0"))
      "mx" (lambda () (interactive)
	      (yas-expand-snippet "\\\\($1\\\\)$0"))
      "mq" (lambda () (interactive)
	      (yas-expand-snippet "\\[$1\\]$0"))
      ;; "*I" (lambda () (interactive)
      ;; 	    (yas-expand-snippet "\\begin{enumerate}\n$>\\item $0\n\\end{enumerate}"))
      ;; "*e" (lambda () (interactive)
      ;; 	    (yas-expand-snippet "\\begin{exe}\n$>\\ex $0\n\\end{exe}"))
      ;; "*f" (lambda () (interactive)
      ;; 	    (yas-expand-snippet "\\begin{forest}\n[{$1}\n[{$2}]\n[{$0}]\n]\n\\end{forest}"))
      "*\"" (lambda () (interactive)
	      (yas-expand-snippet "\\enquote{$1}$0"))
      :cond #'texmathp ; expand only while in math 
      "Olon" "O(n \\log n)"
      ";:" "\\coloneq"
      ";;N" "\\mathbb{N}"
      ";T" "\\top"
      ";B" "\\bot"
      ";;x" "\\times"
      ";;v" "\\veebar"
      ";;u" "\\cup"
      ";;{" "\\subseteq"
      ";D" "\\Diamond"
      ";;b" "\\Box" 
      ;; bind to functions!
      "sum" (lambda () (interactive)
	      (yas-expand-snippet "\\sum_{$1}^{$2} $0"))
      "grandu" (lambda () (interactive)
	      (yas-expand-snippet "\\bigcup\limits_{$1} $0"))
      "Span" (lambda () (interactive)
	       (yas-expand-snippet "\\Span($1)$0"))
      "lam" (lambda () (interactive)
	      (yas-expand-snippet "\\lambda $1_{$2}\\,.\\,$0"))
      ;; "set" (lambda () (interactive)
      ;;           (yas-expand-snippet "\\set{ $1 | $2} $0"))
      "txt" (lambda () (interactive)
		(yas-expand-snippet "\\text{$1} $0"))
      ";;o" (lambda () (interactive)
		(yas-expand-snippet "\\oplus"))
      ;; "ev" (lambda () (interactive)
      ;;             (yas-expand-snippet "\\left\\llbracket$3\\right\\rrbracket^$1_$2 $3"))
      ;; clash with event type sigs
      ;; add accent snippets
      :cond #'laas-object-on-left-condition
      "qq" (lambda () (interactive) (laas-wrap-previous-object "sqrt"))))
#+end_src

*** TODO yasnippet

Deprecate in favour of tempel.

#+begin_src emacs-lisp :tangle init.el 
    (use-package yasnippet
      :config
      (yas-reload-all)
      (add-to-list 'yas-snippet-dirs "~/.config/emacs-vanilla/snippets")
      (yas-global-mode 1))
#+end_src

*** TODO Tempel

Templates can be found in [[file:templates]].

#+begin_src emacs-lisp :tangle init.el
  (use-package tempel
    :general
    ("M-p +" 'tempel-complete) ;; M-p completion prefix; see `cape'
    (patrl/leader-keys
      "ti" '(tempel-insert :wk "tempel insert"))
    (:keymaps 'tempel-map
              "TAB" 'tempel-next) ;; progress through fields via `TAB'
    :init
    (defun tempel-setup-capf ()
      (add-hook 'completion-at-point-functions #'tempel-expand))
    (add-hook 'prog-mode-hook 'tempel-setup-capf)
    (add-hook 'text-mode-hook 'tempel-setup-capf))
#+end_src

** Web preview

#+begin_src emacs-lisp :tangle init.el
  (use-package simple-httpd
    :commands httpd-serve-directory)
#+end_src

