docs/index.html
<div id="outline-container-org9b6bb80" class="outline-3">
<h3 id="org9b6bb80"><span class="section-number-3">11.4.</span> Snippets</h3>
<div class="outline-text-3" id="text-11-4">
</div>
<div id="outline-container-org3ee19ff" class="outline-4">
<h4 id="org3ee19ff"><span class="section-number-4">11.4.1.</span> Auto-activating snippets</h4>
<div class="outline-text-4" id="text-11-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">aas</span>
  <span style="color: #f38ba8;">:hook</span> (LaTeX-mode . aas-activate-for-major-mode)
  <span style="color: #f38ba8;">:hook</span> (org-mode . aas-activate-for-major-mode)
  <span style="color: #f38ba8;">:config</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">easy emoji entry in text mode.</span>
  (aas-set-snippets 'text-mode
    <span style="color: #a6e3a1;">":-)"</span> <span style="color: #a6e3a1;">"&#128578;"</span>
    <span style="color: #a6e3a1;">"8-)"</span> <span style="color: #a6e3a1;">"&#128526;"</span>
    <span style="color: #a6e3a1;">":rofl"</span> <span style="color: #a6e3a1;">"&#129315;"</span>
    <span style="color: #a6e3a1;">":lol"</span> <span style="color: #a6e3a1;">"&#128514;"</span>
    <span style="color: #a6e3a1;">"&lt;3"</span> <span style="color: #a6e3a1;">"&#10084;&#65039;"</span>
    <span style="color: #a6e3a1;">":eyes"</span> <span style="color: #a6e3a1;">"&#128064;"</span>
    <span style="color: #a6e3a1;">":dragon"</span> <span style="color: #a6e3a1;">"&#128009;"</span>
    <span style="color: #a6e3a1;">":fire"</span> <span style="color: #a6e3a1;">"&#128293;"</span>
    <span style="color: #a6e3a1;">":hole"</span> <span style="color: #a6e3a1;">"&#128371;&#65039;"</span>
    <span style="color: #a6e3a1;">":flush"</span> <span style="color: #a6e3a1;">"&#128563;"</span>
    <span style="color: #a6e3a1;">":wow"</span> <span style="color: #a6e3a1;">"&#128558;"</span>))
</pre>
</div>

<p>
Not sure if laas mode is properly activating in latex mode. 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">laas</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">disables accent snippets - things like 'l (which expands to \textsl{}) end up being very disruptive in practice.</span>
  <span style="color: #f38ba8;">:init</span> (<span style="color: #cba6f7;">setq</span> laas-accent-snippets nil)
  <span style="color: #f38ba8;">:hook</span> ((LaTeX-mode . laas-mode)
           (org-mode . laas-mode))
  <span style="color: #f38ba8;">:config</span>
  (aas-set-snippets 'laas-mode
    <span style="color: #6c7086;">;; </span><span style="color: #505050;">I need to make sure not to accidentally trigger the following, so I should only use impossible (or extremely rare) bigrams/trigrams.</span>
    <span style="color: #6c7086;">;; </span><span style="color: #505050;">"*b" (lambda () (interactive)</span>
    <span style="color: #6c7086;">;;        </span><span style="color: #505050;">(yas-expand-snippet "\\textbf{$1}$0"))</span>
    <span style="color: #6c7086;">;; </span><span style="color: #505050;">"*i" (lambda () (interactive)</span>
    <span style="color: #6c7086;">;; </span><span style="color: #505050;">    (yas-expand-snippet "\\textit{$1}$0"))</span>
    <span style="color: #a6e3a1;">"mx"</span> (<span style="color: #cba6f7;">lambda</span> () (<span style="color: #cba6f7;">interactive</span>)
              (yas-expand-snippet <span style="color: #a6e3a1;">"\\\\($1\\\\)$0"</span>))
    <span style="color: #a6e3a1;">"mq"</span> (<span style="color: #cba6f7;">lambda</span> () (<span style="color: #cba6f7;">interactive</span>)
              (yas-expand-snippet <span style="color: #a6e3a1;">"\\[</span><span style="color: #fab387;">$1\\</span><span style="color: #a6e3a1;">]$0"</span>))
    <span style="color: #6c7086;">;; </span><span style="color: #505050;">"*I" (lambda () (interactive)</span>
    <span style="color: #6c7086;">;; </span><span style="color: #505050;">     (yas-expand-snippet "\\begin{enumerate}\n$&gt;\\item $0\n\\end{enumerate}"))</span>
    <span style="color: #6c7086;">;; </span><span style="color: #505050;">"*e" (lambda () (interactive)</span>
    <span style="color: #6c7086;">;; </span><span style="color: #505050;">     (yas-expand-snippet "\\begin{exe}\n$&gt;\\ex $0\n\\end{exe}"))</span>
    <span style="color: #6c7086;">;; </span><span style="color: #505050;">"*f" (lambda () (interactive)</span>
    <span style="color: #6c7086;">;; </span><span style="color: #505050;">     (yas-expand-snippet "\\begin{forest}\n[{$1}\n[{$2}]\n[{$0}]\n]\n\\end{forest}"))</span>
    <span style="color: #a6e3a1;">"*\""</span> (<span style="color: #cba6f7;">lambda</span> () (<span style="color: #cba6f7;">interactive</span>)
              (yas-expand-snippet <span style="color: #a6e3a1;">"\\enquote{$1}$0"</span>))
    <span style="color: #f38ba8;">:cond</span> #'texmathp <span style="color: #6c7086;">; </span><span style="color: #505050;">expand only while in math </span>
    <span style="color: #a6e3a1;">"Olon"</span> <span style="color: #a6e3a1;">"O(n \\log n)"</span>
    <span style="color: #a6e3a1;">";:"</span> <span style="color: #a6e3a1;">"\\coloneq"</span>
    <span style="color: #a6e3a1;">";;N"</span> <span style="color: #a6e3a1;">"\\mathbb{N}"</span>
    <span style="color: #a6e3a1;">";T"</span> <span style="color: #a6e3a1;">"\\top"</span>
    <span style="color: #a6e3a1;">";B"</span> <span style="color: #a6e3a1;">"\\bot"</span>
    <span style="color: #a6e3a1;">";;x"</span> <span style="color: #a6e3a1;">"\\times"</span>
    <span style="color: #a6e3a1;">";;v"</span> <span style="color: #a6e3a1;">"\\veebar"</span>
    <span style="color: #a6e3a1;">";;u"</span> <span style="color: #a6e3a1;">"\\cup"</span>
    <span style="color: #a6e3a1;">";;{"</span> <span style="color: #a6e3a1;">"\\subseteq"</span>
    <span style="color: #a6e3a1;">";D"</span> <span style="color: #a6e3a1;">"\\Diamond"</span>
    <span style="color: #a6e3a1;">";;b"</span> <span style="color: #a6e3a1;">"\\Box"</span> 
    <span style="color: #6c7086;">;; </span><span style="color: #505050;">bind to functions!</span>
    <span style="color: #a6e3a1;">"sum"</span> (<span style="color: #cba6f7;">lambda</span> () (<span style="color: #cba6f7;">interactive</span>)
              (yas-expand-snippet <span style="color: #a6e3a1;">"\\sum_{$1}^{$2} $0"</span>))
    <span style="color: #a6e3a1;">"grandu"</span> (<span style="color: #cba6f7;">lambda</span> () (<span style="color: #cba6f7;">interactive</span>)
              (yas-expand-snippet <span style="color: #a6e3a1;">"\\bigcup</span><span style="color: #813e00; font-weight: bold;">\</span><span style="color: #a6e3a1;">limits_{$1} $0"</span>))
    <span style="color: #a6e3a1;">"Span"</span> (<span style="color: #cba6f7;">lambda</span> () (<span style="color: #cba6f7;">interactive</span>)
               (yas-expand-snippet <span style="color: #a6e3a1;">"\\Span($1)$0"</span>))
    <span style="color: #a6e3a1;">"lam"</span> (<span style="color: #cba6f7;">lambda</span> () (<span style="color: #cba6f7;">interactive</span>)
              (yas-expand-snippet <span style="color: #a6e3a1;">"\\lambda $1_{$2}\\,.\\,$0"</span>))
    <span style="color: #6c7086;">;; </span><span style="color: #505050;">"set" (lambda () (interactive)</span>
    <span style="color: #6c7086;">;;           </span><span style="color: #505050;">(yas-expand-snippet "\\set{ $1 | $2} $0"))</span>
    <span style="color: #a6e3a1;">"txt"</span> (<span style="color: #cba6f7;">lambda</span> () (<span style="color: #cba6f7;">interactive</span>)
                (yas-expand-snippet <span style="color: #a6e3a1;">"\\text{$1} $0"</span>))
    <span style="color: #a6e3a1;">";;o"</span> (<span style="color: #cba6f7;">lambda</span> () (<span style="color: #cba6f7;">interactive</span>)
                (yas-expand-snippet <span style="color: #a6e3a1;">"\\oplus"</span>))
    <span style="color: #6c7086;">;; </span><span style="color: #505050;">"ev" (lambda () (interactive)</span>
    <span style="color: #6c7086;">;;             </span><span style="color: #505050;">(yas-expand-snippet "\\left\\llbracket$3\\right\\rrbracket^$1_$2 $3"))</span>
    <span style="color: #6c7086;">;; </span><span style="color: #505050;">clash with event type sigs</span>
    <span style="color: #6c7086;">;; </span><span style="color: #505050;">add accent snippets</span>
    <span style="color: #f38ba8;">:cond</span> #'laas-object-on-left-condition
    <span style="color: #a6e3a1;">"qq"</span> (<span style="color: #cba6f7;">lambda</span> () (<span style="color: #cba6f7;">interactive</span>) (laas-wrap-previous-object <span style="color: #a6e3a1;">"sqrt"</span>))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orga5cbab0" class="outline-4">
<h4 id="orga5cbab0"><span class="section-number-4">11.4.2.</span> <span class="todo TODO">TODO</span> yasnippet</h4>
<div class="outline-text-4" id="text-11-4-2">
<p>
Deprecate in favour of tempel.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">yasnippet</span>
  <span style="color: #f38ba8;">:config</span>
  (yas-reload-all)
  (add-to-list 'yas-snippet-dirs <span style="color: #a6e3a1;">"~/.config/emacs-vanilla/snippets"</span>)
  (yas-global-mode 1))
</pre>
</div>
</div>
</div>
<div id="outline-container-orga1242b1" class="outline-4">
<h4 id="orga1242b1"><span class="section-number-4">11.4.3.</span> <span class="todo TODO">TODO</span> Tempel</h4>
<div class="outline-text-4" id="text-11-4-3">
<p>
Templates can be found in <a href="templates">templates</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">tempel</span>
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #a6e3a1;">"M-p +"</span> 'tempel-complete) <span style="color: #6c7086;">;; </span><span style="color: #505050;">M-p completion prefix; see `</span><span style="color: #fab387;">cape</span><span style="color: #505050;">'</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"ti"</span> '(tempel-insert <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"tempel insert"</span>))
  (<span style="color: #f38ba8;">:keymaps</span> 'tempel-map
            <span style="color: #a6e3a1;">"TAB"</span> 'tempel-next) <span style="color: #6c7086;">;; </span><span style="color: #505050;">progress through fields via `</span><span style="color: #fab387;">TAB</span><span style="color: #505050;">'</span>
  <span style="color: #f38ba8;">:init</span>
  (<span style="color: #cba6f7;">defun</span> <span style="color: #89b4fa;">tempel-setup-capf</span> ()
    (add-hook 'completion-at-point-functions #'tempel-expand))
  (add-hook 'prog-mode-hook 'tempel-setup-capf)
  (add-hook 'text-mode-hook 'tempel-setup-capf))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf85ceed" class="outline-3">
<h3 id="orgf85ceed"><span class="section-number-3">11.5.</span> Web preview</h3>
<div class="outline-text-3" id="text-11-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">simple-httpd</span>
  <span style="color: #f38ba8;">:commands</span> httpd-serve-directory)
</pre>
</div>
</div>
</div>
