readme.org
** Magit

#+begin_src emacs-lisp :tangle init.el
  (use-package magit
    :general
    (patrl/leader-keys
      "g" '(:ignore t :wk "git")
      "gg" '(magit-status :wk "status")))
#+end_src

** Eshell

#+begin_src emacs-lisp :tangle init.el 
  (use-package eshell
    :straight (:type built-in)
    :general
    (patrl/leader-keys
      "oe" '(eshell :wk "eshell")))
#+end_src

** Language servers

*** LSP mode 

Note I still need to set keybindings

#+begin_src emacs-lisp :tangle init.el
  (use-package lsp-mode
    :custom
    (lsp-completion-provider :none) ;; we use corfu!
    :init
    (defun patrl/lsp-mode-setup-completion ()
      (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
            '(orderless))) ;; Configure orderless
    :hook
    (lsp-mode . lsp-enable-which-key-integration)
    (lsp-completion-mode . patrl/lsp-mode-setup-completion) ;; setup orderless completion style.
    :commands
    lsp)

  (use-package lsp-ui
    :after lsp-mode
    :commands lsp-ui-mode)

  (use-package lsp-haskell
    :after lsp-mode
    :config
    (setq lsp-haskell-server-path "haskell-language-server") ;; for some reason this doesn't get found automatically
    ;; (setq lsp-haskell-formatting-provider "brittany")
    )
#+end_src


*** Eglot

Note that ~eglot~ will be in emacs 29.

- Integrating corfu with eglot: [[https://github.com/minad/corfu/wiki][Home · minad/corfu Wiki · GitHub]]

#+begin_src emacs-lisp :tangle init.el
  (use-package eglot
    :init (setq completion-category-overrides '((eglot (styles orderless))))
    :commands eglot
    :config
    (add-to-list 'eglot-server-programs '(haskell-mode . ("haskell-language-server" "--lsp"))))
#+end_src


** direnv

Essential, since I'm on NixOS.

#+begin_src emacs-lisp :tangle init.el
  (use-package direnv
    :config
    (direnv-mode))
#+end_src

** Kmonad

#+begin_src emacs-lisp :tangle init.el
    (use-package kbd-mode 
      :straight (:type git :host github :repo
                       "kmonad/kbd-mode"))
#+end_src

*** TODO disable flymake mode in kbd-mode

** TODO Elfeed

Resources:
- [[https://karthinks.com/software/lazy-elfeed/][Lazy Elfeed | Karthinks]]

#+begin_src emacs-lisp :tangle init.el
  ;; We write a function to determine how we want elfeed to display the buffer with the current entry.
  (defun patrl/elfeed-display-buffer (buf &optional act)
    (pop-to-buffer buf)
    (set-window-text-height (get-buffer-window) (round (* 0.7 (frame-height)))))

  (defun patrl/elfeed-search-show-entry-pre (&optional lines)
    "Returns a function to scroll forward or back in the Elfeed search results, displaying entries without switching to them."
    (lambda (times)
      (interactive "p")
      (forward-line (* times (or lines 0)))
      (recenter)
      (call-interactively #'elfeed-search-show-entry)
      (select-window (previous-window))
      (unless elfeed-search-remain-on-entry (forward-line -1))))

  (use-package elfeed
    :commands elfeed
    :general
    (patrl/leader-keys
      "oE" '(elfeed :wk "elfeed"))
    ;; :config
    (setq elfeed-show-entry-switch #'patrl/elfeed-display-buffer))

  (use-package elfeed-org
    :init
   (setq rmh-elfeed-org-files (list "~/Dropbox (MIT)/org/elfeed.org"))
    :config
    (elfeed-org))
#+end_src

