docs/index.html
<div id="outline-container-org4c0d57f" class="outline-3">
<h3 id="org4c0d57f"><span class="section-number-3">11.6.</span> Magit</h3>
<div class="outline-text-3" id="text-11-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">magit</span>
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"g"</span> '(<span style="color: #f38ba8;">:ignore</span> t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"git"</span>)
    <span style="color: #a6e3a1;">"gg"</span> '(magit-status <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"status"</span>)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org4c887bf" class="outline-3">
<h3 id="org4c887bf"><span class="section-number-3">11.7.</span> Eshell</h3>
<div class="outline-text-3" id="text-11-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">eshell</span>
  <span style="color: #f38ba8;">:straight</span> (<span style="color: #f38ba8;">:type</span> built-in)
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"oe"</span> '(eshell <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"eshell"</span>)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orge45e8c3" class="outline-3">
<h3 id="orge45e8c3"><span class="section-number-3">11.8.</span> Language servers</h3>
<div class="outline-text-3" id="text-11-8">
</div>
<div id="outline-container-orgdfb8a8e" class="outline-4">
<h4 id="orgdfb8a8e"><span class="section-number-4">11.8.1.</span> LSP mode</h4>
<div class="outline-text-4" id="text-11-8-1">
<p>
Note I still need to set keybindings
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">lsp-mode</span>
  <span style="color: #f38ba8;">:custom</span>
  (lsp-completion-provider <span style="color: #f38ba8;">:none</span>) <span style="color: #6c7086;">;; </span><span style="color: #505050;">we use corfu!</span>
  <span style="color: #f38ba8;">:init</span>
  (<span style="color: #cba6f7;">defun</span> <span style="color: #89b4fa;">patrl/lsp-mode-setup-completion</span> ()
    (<span style="color: #cba6f7;">setf</span> (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
          '(orderless))) <span style="color: #6c7086;">;; </span><span style="color: #505050;">Configure orderless</span>
  <span style="color: #f38ba8;">:hook</span>
  (lsp-mode . lsp-enable-which-key-integration)
  (lsp-completion-mode . patrl/lsp-mode-setup-completion) <span style="color: #6c7086;">;; </span><span style="color: #505050;">setup orderless completion style.</span>
  <span style="color: #f38ba8;">:commands</span>
  lsp)

(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">lsp-ui</span>
  <span style="color: #f38ba8;">:after</span> lsp-mode
  <span style="color: #f38ba8;">:commands</span> lsp-ui-mode)

(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">lsp-haskell</span>
  <span style="color: #f38ba8;">:after</span> lsp-mode
  <span style="color: #f38ba8;">:config</span>
  (<span style="color: #cba6f7;">setq</span> lsp-haskell-server-path <span style="color: #a6e3a1;">"haskell-language-server"</span>) <span style="color: #6c7086;">;; </span><span style="color: #505050;">for some reason this doesn't get found automatically</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">(setq lsp-haskell-formatting-provider "brittany")</span>
  )
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf06606a" class="outline-4">
<h4 id="orgf06606a"><span class="section-number-4">11.8.2.</span> Eglot</h4>
<div class="outline-text-4" id="text-11-8-2">
<p>
Note that <code>eglot</code> will be in emacs 29.
</p>

<ul class="org-ul">
<li>Integrating corfu with eglot: <a href="https://github.com/minad/corfu/wiki">Home · minad/corfu Wiki · GitHub</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">eglot</span>
  <span style="color: #f38ba8;">:init</span> (<span style="color: #cba6f7;">setq</span> completion-category-overrides '((eglot (styles orderless))))
  <span style="color: #f38ba8;">:commands</span> eglot
  <span style="color: #f38ba8;">:config</span>
  (add-to-list 'eglot-server-programs '(haskell-mode . (<span style="color: #a6e3a1;">"haskell-language-server"</span> <span style="color: #a6e3a1;">"--lsp"</span>))))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgce67b80" class="outline-3">
<h3 id="orgce67b80"><span class="section-number-3">11.9.</span> direnv</h3>
<div class="outline-text-3" id="text-11-9">
<p>
Essential, since I'm on NixOS.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">direnv</span>
  <span style="color: #f38ba8;">:config</span>
  (direnv-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfe110f2" class="outline-3">
<h3 id="orgfe110f2"><span class="section-number-3">11.10.</span> Kmonad</h3>
<div class="outline-text-3" id="text-11-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">kbd-mode</span> 
  <span style="color: #f38ba8;">:straight</span> (<span style="color: #f38ba8;">:type</span> git <span style="color: #f38ba8;">:host</span> github <span style="color: #f38ba8;">:repo</span>
                   <span style="color: #a6e3a1;">"kmonad/kbd-mode"</span>))
</pre>
</div>
</div>
<div id="outline-container-orgfc8e496" class="outline-4">
<h4 id="orgfc8e496"><span class="section-number-4">11.10.1.</span> <span class="todo TODO">TODO</span> disable flymake mode in kbd-mode</h4>
</div>
</div>
<div id="outline-container-orgfe960c7" class="outline-3">
<h3 id="orgfe960c7"><span class="section-number-3">11.11.</span> <span class="todo TODO">TODO</span> Elfeed</h3>
<div class="outline-text-3" id="text-11-11">
<p>
Resources:
</p>
<ul class="org-ul">
<li><a href="https://karthinks.com/software/lazy-elfeed/">Lazy Elfeed | Karthinks</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #6c7086;">;; </span><span style="color: #505050;">We write a function to determine how we want elfeed to display the buffer with the current entry.</span>
(<span style="color: #cba6f7;">defun</span> <span style="color: #89b4fa;">patrl/elfeed-display-buffer</span> (buf <span style="color: #f9e2af;">&amp;optional</span> act)
  (pop-to-buffer buf)
  (set-window-text-height (get-buffer-window) (round (* 0.7 (frame-height)))))

(<span style="color: #cba6f7;">defun</span> <span style="color: #89b4fa;">patrl/elfeed-search-show-entry-pre</span> (<span style="color: #f9e2af;">&amp;optional</span> lines)
  <span style="color: #2a486a;">"Returns a function to scroll forward or back in the Elfeed search results, displaying entries without switching to them."</span>
  (<span style="color: #cba6f7;">lambda</span> (times)
    (<span style="color: #cba6f7;">interactive</span> <span style="color: #a6e3a1;">"p"</span>)
    (forward-line (* times (<span style="color: #cba6f7;">or</span> lines 0)))
    (recenter)
    (call-interactively #'elfeed-search-show-entry)
    (select-window (previous-window))
    (<span style="color: #cba6f7;">unless</span> elfeed-search-remain-on-entry (forward-line -1))))

(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">elfeed</span>
  <span style="color: #f38ba8;">:commands</span> elfeed
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"oE"</span> '(elfeed <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"elfeed"</span>))
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">:config</span>
  (<span style="color: #cba6f7;">setq</span> elfeed-show-entry-switch #'patrl/elfeed-display-buffer))

(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">elfeed-org</span>
  <span style="color: #f38ba8;">:init</span>
 (<span style="color: #cba6f7;">setq</span> rmh-elfeed-org-files (list <span style="color: #a6e3a1;">"~/Dropbox (MIT)/org/elfeed.org"</span>))
  <span style="color: #f38ba8;">:config</span>
  (elfeed-org))
</pre>
</div>
</div>
</div>
