readme.org
** TODO Notmuch

A gmail-focused notmuch setup, with ~lieer~ as the sync backend.

#+begin_src emacs-lisp :tangle init.el
  (use-package notmuch
    :init
    ;; in gmail, messages are trashed by removing the 'inbox' tag, and adding the 'trash' tag. This will move messages to the gmail trash folder, but won't permnanently delete them.
    (defvar +notmuch-delete-tags '("+trash" "-inbox" "-unread" "-new"))
    ;; in gmail, messages are archived simply by removing the 'inbox' tag.
    (setq notmuch-archive-tags '("-inbox" "-new"))
    ;; show new mail first
    :config
    ;; the 'new' tag isn't synced to the gmail server; messages new to notmuch aquire this tag.
    (add-to-list 'notmuch-saved-searches '(:name "new" :query "tag:new" :key "n"))
    (defun +notmuch/search-delete ()
      (interactive)
      (notmuch-search-add-tag +notmuch-delete-tags)
      (notmuch-tree-next-message))
    (defun +notmuch/tree-delete ()
      (interactive)
      (notmuch-tree-add-tag +notmuch-delete-tags)
      (notmuch-tree-next-message))
    (setq-default notmuch-search-oldest-first nil)
    ;; sending mail using lieer
    (setq message-kill-buffer-on-exit t)
    (setq sendmail-program "gmi")
    (setq send-mail-function 'sendmail-send-it)
    (setq message-sendmail-extra-arguments '("send" "--quiet" "-t" "-C" "~/.mail/personal"))
    (setq notmuch-fcc-dirs nil) ;; let gmail take care of sent mail
    :general
    (patrl/leader-keys
      "on" '(notmuch :wk "notmuch")) 
    ;; single key deletion.
    (:keymaps 'notmuch-search-mode-map
              :states 'normal
              "D" '+notmuch/search-delete)
    (:keymaps 'notmuch-tree-mode-map
              :states 'normal
              "D" '+notmuch/tree-delete))
#+end_src

*** consult-notmuch

Search emails interactively using ~consult~.

#+begin_src emacs-lisp :tangle init.el
  (use-package consult-notmuch
    :general
    (patrl/leader-keys
      "nmm" '(consult-notmuch t :wk "consult notmuch")
      "nmt" '(consult-notmuch-tree t :wk "consult notmuch tree")
      "nma" '(consult-notmuch-address t :wk "consult notmuch address"))
    :after notmuch)
#+end_src


* Staging grounds

** Rainbow mode

#+begin_src emacs-lisp :tangle init.el
  (use-package rainbow-mode)
#+end_src

** Burly

#+begin_src emacs-lisp :tangle init.el
  (use-package burly
    :init
    (burly-tabs-mode +1)
    :general
    (patrl/leader-keys
      "Bf" '(burly-bookmark-frames t :wk "bookmark frames")
      "Bw" '(burly-bookmark-windows t :wk "bookmark windows")
      "Bo" '(burly-open-bookmark t :wk "open bookmark")
      "Bl" '(burly-open-last-bookmark t :wk "open last bookmark")))
#+end_src

** Ebib

- [[https://joostkremers.github.io/ebib/][Ebib]]


#+begin_src emacs-lisp :tangle init.el
  (use-package ebib
    :config
    (setq ebib-bibtex-dialect 'biblatex)
    (setq ebib-preload-bib-files (list patrl/global-bib-file))
    :general
    (patrl/leader-keys
      "ob" '(ebib :wk "ebib")))
#+end_src

*** TODO add biblio support

** Tree-sitter

#+begin_src emacs-lisp :tangle init.el
  (use-package tree-sitter)
  (use-package tree-sitter-langs)
#+end_src

* Graveyard

Packages i've tried out which, for whatever reason, haven't suited me.

** Flymake-aspell 

Superseded by [[Jinx]].

#+begin_src emacs-lisp
  (use-package flymake-aspell
    :after flymake)
#+end_src

#+begin_src emacs-lisp
  (use-package ispell
    :straight (:type built-in)
    :init
    (setq ispell-dictionary "en_US")
    (setq ispell-program-name "aspell")
    (setq ispell-silently-savep t))
#+end_src


** Mastodon

#+begin_src emacs-lisp
  (use-package mastodon
    :config
    (setq mastodon-instance-url "https://types.pl"
	  mastodon-active-user "patrl"))
#+end_src

