docs/index.html
<div id="outline-container-org1df8a6e" class="outline-3">
<h3 id="org1df8a6e"><span class="section-number-3">11.12.</span> <span class="todo TODO">TODO</span> Notmuch</h3>
<div class="outline-text-3" id="text-11-12">
<p>
A gmail-focused notmuch setup, with <code>lieer</code> as the sync backend.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">notmuch</span>
  <span style="color: #f38ba8;">:init</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">in gmail, messages are trashed by removing the '</span><span style="color: #fab387;">inbox</span><span style="color: #505050;">' tag, and adding the '</span><span style="color: #fab387;">trash</span><span style="color: #505050;">' tag. This will move messages to the gmail trash folder, but won't permnanently delete them.</span>
  (<span style="color: #cba6f7;">defvar</span> <span style="color: #cdd6f4;">+notmuch-delete-tags</span> '(<span style="color: #a6e3a1;">"+trash"</span> <span style="color: #a6e3a1;">"-inbox"</span> <span style="color: #a6e3a1;">"-unread"</span> <span style="color: #a6e3a1;">"-new"</span>))
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">in gmail, messages are archived simply by removing the '</span><span style="color: #fab387;">inbox</span><span style="color: #505050;">' tag.</span>
  (<span style="color: #cba6f7;">setq</span> notmuch-archive-tags '(<span style="color: #a6e3a1;">"-inbox"</span> <span style="color: #a6e3a1;">"-new"</span>))
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">show new mail first</span>
  <span style="color: #f38ba8;">:config</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">the '</span><span style="color: #fab387;">new</span><span style="color: #505050;">' tag isn't synced to the gmail server; messages new to notmuch aquire this tag.</span>
  (add-to-list 'notmuch-saved-searches '(<span style="color: #f38ba8;">:name</span> <span style="color: #a6e3a1;">"new"</span> <span style="color: #f38ba8;">:query</span> <span style="color: #a6e3a1;">"tag:new"</span> <span style="color: #f38ba8;">:key</span> <span style="color: #a6e3a1;">"n"</span>))
  (<span style="color: #cba6f7;">defun</span> <span style="color: #89b4fa;">+notmuch/search-delete</span> ()
    (<span style="color: #cba6f7;">interactive</span>)
    (notmuch-search-add-tag +notmuch-delete-tags)
    (notmuch-tree-next-message))
  (<span style="color: #cba6f7;">defun</span> <span style="color: #89b4fa;">+notmuch/tree-delete</span> ()
    (<span style="color: #cba6f7;">interactive</span>)
    (notmuch-tree-add-tag +notmuch-delete-tags)
    (notmuch-tree-next-message))
  (<span style="color: #cba6f7;">setq-default</span> notmuch-search-oldest-first nil)
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">sending mail using lieer</span>
  (<span style="color: #cba6f7;">setq</span> message-kill-buffer-on-exit t)
  (<span style="color: #cba6f7;">setq</span> sendmail-program <span style="color: #a6e3a1;">"gmi"</span>)
  (<span style="color: #cba6f7;">setq</span> send-mail-function 'sendmail-send-it)
  (<span style="color: #cba6f7;">setq</span> message-sendmail-extra-arguments '(<span style="color: #a6e3a1;">"send"</span> <span style="color: #a6e3a1;">"--quiet"</span> <span style="color: #a6e3a1;">"-t"</span> <span style="color: #a6e3a1;">"-C"</span> <span style="color: #a6e3a1;">"~/.mail/personal"</span>))
  (<span style="color: #cba6f7;">setq</span> notmuch-fcc-dirs nil) <span style="color: #6c7086;">;; </span><span style="color: #505050;">let gmail take care of sent mail</span>
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"on"</span> '(notmuch <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"notmuch"</span>)) 
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">single key deletion.</span>
  (<span style="color: #f38ba8;">:keymaps</span> 'notmuch-search-mode-map
            <span style="color: #f38ba8;">:states</span> 'normal
            <span style="color: #a6e3a1;">"D"</span> '+notmuch/search-delete)
  (<span style="color: #f38ba8;">:keymaps</span> 'notmuch-tree-mode-map
            <span style="color: #f38ba8;">:states</span> 'normal
            <span style="color: #a6e3a1;">"D"</span> '+notmuch/tree-delete))
</pre>
</div>
</div>
<div id="outline-container-org9c427ec" class="outline-4">
<h4 id="org9c427ec"><span class="section-number-4">11.12.1.</span> consult-notmuch</h4>
<div class="outline-text-4" id="text-11-12-1">
<p>
Search emails interactively using <code>consult</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">consult-notmuch</span>
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"nmm"</span> '(consult-notmuch t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"consult notmuch"</span>)
    <span style="color: #a6e3a1;">"nmt"</span> '(consult-notmuch-tree t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"consult notmuch tree"</span>)
    <span style="color: #a6e3a1;">"nma"</span> '(consult-notmuch-address t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"consult notmuch address"</span>))
  <span style="color: #f38ba8;">:after</span> notmuch)
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org3b9ccf5" class="outline-2">
<h2 id="org3b9ccf5"><span class="section-number-2">12.</span> Staging grounds</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-orgcd1d98d" class="outline-3">
<h3 id="orgcd1d98d"><span class="section-number-3">12.1.</span> Rainbow mode</h3>
<div class="outline-text-3" id="text-12-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">rainbow-mode</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org42e1a66" class="outline-3">
<h3 id="org42e1a66"><span class="section-number-3">12.2.</span> Burly</h3>
<div class="outline-text-3" id="text-12-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">burly</span>
  <span style="color: #f38ba8;">:init</span>
  (burly-tabs-mode +1)
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"Bf"</span> '(burly-bookmark-frames t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"bookmark frames"</span>)
    <span style="color: #a6e3a1;">"Bw"</span> '(burly-bookmark-windows t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"bookmark windows"</span>)
    <span style="color: #a6e3a1;">"Bo"</span> '(burly-open-bookmark t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"open bookmark"</span>)
    <span style="color: #a6e3a1;">"Bl"</span> '(burly-open-last-bookmark t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"open last bookmark"</span>)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org3d8bdb5" class="outline-3">
<h3 id="org3d8bdb5"><span class="section-number-3">12.3.</span> Ebib</h3>
<div class="outline-text-3" id="text-12-3">
<ul class="org-ul">
<li><a href="https://joostkremers.github.io/ebib/">Ebib</a></li>
</ul>


<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">ebib</span>
  <span style="color: #f38ba8;">:config</span>
  (<span style="color: #cba6f7;">setq</span> ebib-bibtex-dialect 'biblatex)
  (<span style="color: #cba6f7;">setq</span> ebib-preload-bib-files (list patrl/global-bib-file))
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"ob"</span> '(ebib <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"ebib"</span>)))
</pre>
</div>
</div>
<div id="outline-container-orgd15ff3b" class="outline-4">
<h4 id="orgd15ff3b"><span class="section-number-4">12.3.1.</span> <span class="todo TODO">TODO</span> add biblio support</h4>
</div>
</div>
<div id="outline-container-orgea3b126" class="outline-3">
<h3 id="orgea3b126"><span class="section-number-3">12.4.</span> Tree-sitter</h3>
<div class="outline-text-3" id="text-12-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">tree-sitter</span>)
(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">tree-sitter-langs</span>)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc4b10cb" class="outline-2">
<h2 id="orgc4b10cb"><span class="section-number-2">13.</span> Graveyard</h2>
<div class="outline-text-2" id="text-13">
<p>
Packages i've tried out which, for whatever reason, haven't suited me.
</p>
</div>
<div id="outline-container-org44fe114" class="outline-3">
<h3 id="org44fe114"><span class="section-number-3">13.1.</span> Flymake-aspell</h3>
<div class="outline-text-3" id="text-13-1">
<p>
Superseded by <a href="#org91bc335">11.1</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">flymake-aspell</span>
  <span style="color: #f38ba8;">:after</span> flymake)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">ispell</span>
  <span style="color: #f38ba8;">:straight</span> (<span style="color: #f38ba8;">:type</span> built-in)
  <span style="color: #f38ba8;">:init</span>
  (<span style="color: #cba6f7;">setq</span> ispell-dictionary <span style="color: #a6e3a1;">"en_US"</span>)
  (<span style="color: #cba6f7;">setq</span> ispell-program-name <span style="color: #a6e3a1;">"aspell"</span>)
  (<span style="color: #cba6f7;">setq</span> ispell-silently-savep t))
</pre>
</div>
</div>
</div>
<div id="outline-container-org1ef9cf1" class="outline-3">
<h3 id="org1ef9cf1"><span class="section-number-3">13.2.</span> Mastodon</h3>
<div class="outline-text-3" id="text-13-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">mastodon</span>
  <span style="color: #f38ba8;">:config</span>
  (<span style="color: #cba6f7;">setq</span> mastodon-instance-url <span style="color: #a6e3a1;">"https://types.pl"</span>
          mastodon-active-user <span style="color: #a6e3a1;">"patrl"</span>))
</pre>
</div>
</div>
</div>
