readme.org
** ~0x0~

#+begin_src emacs-lisp
  (use-package 0x0
    :general
    (patrl/leader-keys
      "x" '(:ignore t :wk "web")
      "x;" '(0x0-dwim t :wk "0x0 dwim")
      "xt" '(0x0-upload-text :wk "0x0 upload text")
      "xf" '(0x0-upload-file :wk "0x0 upload file")
      "xk" '(0x0-upload-kill-ring :wk "0x0 upload kill ring")
      "xp" '(0x0-popup :wk "0x0 popup")
      "xs" '(0x0-shorten-uri :wk "0x0 shorten url")))
#+end_src

** Org-re-reveal

#+begin_src emacs-lisp
  (use-package org-re-reveal)
#+end_src

** Org-present 

#+begin_src emacs-lisp
  (use-package org-present)
#+end_src

** Sidebar

#+begin_src emacs-lisp
  (use-package org-sidebar
    :after org
    :straight (:type git :host github :repo "alphapapa/org-sidebar"))
#+end_src
   
** company

#+begin_src emacs-lisp
  (use-package company
    :custom
    (company-idle-delay nil) ;; turn off auto-completion
    :general
    (:keymap 'company-mode-map
             "C-SPC" 'company-complete) ;; keybinding to trigger company completion
    :hook
    (prog-mode . company-mode)
    (LaTeX-mode . company-mode)
    :config
    ;; the following stops company from using the orderless completion style
    ;; makes company much more useful
    (define-advice company-capf
        (:around (orig-fun &rest args) set-completion-styles)
      (let ((completion-styles '(basic partial-completion)))
        (apply orig-fun args))))
#+end_src 

 
* File local variables                                             :noexport:

;; Local Variables: 
;; eval: (add-hook 'after-save-hook (lambda nil (if (y-or-n-p "Export?") (org-html-export-to-html))) nil t) 
;; eval: (add-hook 'after-save-hook (lambda ()(if (y-or-n-p "Reload?")(load-file user-init-file))) nil t) 
;; eval: (add-hook 'after-save-hook (lambda ()(if (y-or-n-p "Tangle?")(org-babel-tangle))) nil t) 
;; End:

