docs/index.html
<div id="outline-container-orga175e79" class="outline-3">
<h3 id="orga175e79"><span class="section-number-3">13.3.</span> <code>0x0</code></h3>
<div class="outline-text-3" id="text-13-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">0x0</span>
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #cba6f7;">patrl/leader-keys</span>
    <span style="color: #a6e3a1;">"x"</span> '(<span style="color: #f38ba8;">:ignore</span> t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"web"</span>)
    <span style="color: #a6e3a1;">"x;"</span> '(0x0-dwim t <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"0x0 dwim"</span>)
    <span style="color: #a6e3a1;">"xt"</span> '(0x0-upload-text <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"0x0 upload text"</span>)
    <span style="color: #a6e3a1;">"xf"</span> '(0x0-upload-file <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"0x0 upload file"</span>)
    <span style="color: #a6e3a1;">"xk"</span> '(0x0-upload-kill-ring <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"0x0 upload kill ring"</span>)
    <span style="color: #a6e3a1;">"xp"</span> '(0x0-popup <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"0x0 popup"</span>)
    <span style="color: #a6e3a1;">"xs"</span> '(0x0-shorten-uri <span style="color: #f38ba8;">:wk</span> <span style="color: #a6e3a1;">"0x0 shorten url"</span>)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfc6a1c4" class="outline-3">
<h3 id="orgfc6a1c4"><span class="section-number-3">13.4.</span> Org-re-reveal</h3>
<div class="outline-text-3" id="text-13-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">org-re-reveal</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org9c544ea" class="outline-3">
<h3 id="org9c544ea"><span class="section-number-3">13.5.</span> Org-present</h3>
<div class="outline-text-3" id="text-13-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">org-present</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcd17141" class="outline-3">
<h3 id="orgcd17141"><span class="section-number-3">13.6.</span> Sidebar</h3>
<div class="outline-text-3" id="text-13-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">org-sidebar</span>
  <span style="color: #f38ba8;">:after</span> org
  <span style="color: #f38ba8;">:straight</span> (<span style="color: #f38ba8;">:type</span> git <span style="color: #f38ba8;">:host</span> github <span style="color: #f38ba8;">:repo</span> <span style="color: #a6e3a1;">"alphapapa/org-sidebar"</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-org1366240" class="outline-3">
<h3 id="org1366240"><span class="section-number-3">13.7.</span> company</h3>
<div class="outline-text-3" id="text-13-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #cba6f7;">use-package</span> <span style="color: #fab387;">company</span>
  <span style="color: #f38ba8;">:custom</span>
  (company-idle-delay nil) <span style="color: #6c7086;">;; </span><span style="color: #505050;">turn off auto-completion</span>
  <span style="color: #f38ba8;">:general</span>
  (<span style="color: #f38ba8;">:keymap</span> 'company-mode-map
           <span style="color: #a6e3a1;">"C-SPC"</span> 'company-complete) <span style="color: #6c7086;">;; </span><span style="color: #505050;">keybinding to trigger company completion</span>
  <span style="color: #f38ba8;">:hook</span>
  (prog-mode . company-mode)
  (LaTeX-mode . company-mode)
  <span style="color: #f38ba8;">:config</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">the following stops company from using the orderless completion style</span>
  <span style="color: #6c7086;">;; </span><span style="color: #505050;">makes company much more useful</span>
  (<span style="color: #cba6f7;">define-advice</span> <span style="color: #89b4fa;">company-capf</span>
      (<span style="color: #f38ba8;">:around</span> (orig-fun <span style="color: #f9e2af;">&amp;rest</span> args) set-completion-styles)
    (<span style="color: #cba6f7;">let</span> ((completion-styles '(basic partial-completion)))
      (apply orig-fun args))))
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Patrick D. Elliott</p>
<p class="date">Created: 2023-10-04 Wed 16:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>